{
  "snapshot_json": {
    "main": "ATXN3",
    "interactors": [
      {
        "primary": "VCP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "VCP/p97 is a well-established direct interaction partner of ATXN3, validated by co-immunoprecipitation and its involvement in ER-associated degradation (ERAD) pathways alongside ATXN3.",
        "functions": [
          {
            "function": "Endoplasmic Reticulum-Associated Degradation (ERAD)",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 interacts with the N-terminal domain of the AAA+ ATPase VCP/p97 through a VCP binding motif (VBM) near its C-terminus. This interaction is nucleotide-dependent, favored in the absence of nucleotide or the presence of ATP, but not ADP. ATXN3 and other VCP cofactors, such as Ufd1, bind to VCP in a mutually exclusive manner.",
            "effect_description": "By binding to VCP, ATXN3 modulates the ERAD pathway. It competes with the Ufd1 cofactor for VCP binding, which diminishes the retrotranslocation of ubiquitinated substrates from the endoplasmic reticulum to the cytosol for subsequent degradation by the proteasome. This competition effectively reduces the degradation rate of ERAD substrates.",
            "biological_consequence": [
              "ATXN3 binds to VCP/p97 → ATXN3 displaces the Ufd1 cofactor from the VCP complex → VCP-dependent extraction and retrotranslocation of ERAD substrates from the ER is inhibited → Degradation of misfolded ER proteins is slowed → Cellular protein quality control flux is regulated."
            ],
            "specific_effects": [
              "ATXN3 expression leads to increased cellular levels of ERAD substrates, such as CD3δ, by decreasing their rate of degradation.",
              "Pathogenic, polyglutamine-expanded ATXN3 enhances the binding to VCP and decreases the degradation of ERAD substrates to a greater extent than wild-type ATXN3.",
              "Knockdown of endogenous ATXN3 reduces the cellular levels of the ERAD substrate CD3δ.",
              "In a reconstituted in vitro system, ATXN3 inhibits the retrotranslocation of an ERAD substrate from the ER.",
              "The interaction between ATXN3 and VCP is a prerequisite for the ATXN3-dependent accumulation of ERAD substrates."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
                "journal": "Human Molecular Genetics",
                "year": 2006,
                "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER.",
                "pmid": "16822850"
              }
            ],
            "pmids": [
              "16822850"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          },
          {
            "function": "ATXN3 Deubiquitinase (DUB) Activity",
            "arrow": "activates",
            "cellular_process": "The AAA+ ATPase VCP/p97 directly interacts with ATXN3 and enhances its deubiquitinase (DUB) activity. This interaction is thought to position ATXN3 optimally near polyubiquitinated substrates that are being processed by the VCP complex.",
            "effect_description": "VCP-mediated activation of ATXN3's DUB activity facilitates the trimming or removal of ubiquitin chains from VCP-associated substrates. This enzymatic activity can rescue proteins from proteasomal degradation, enable ubiquitin recycling, and regulate the overall flux of substrates through protein degradation pathways.",
            "biological_consequence": [
              "VCP binds a polyubiquitinated substrate → VCP recruits and binds ATXN3 → VCP allosterically activates ATXN3's catalytic Josephin domain → ATXN3 cleaves ubiquitin chains from the VCP-bound substrate → The fate of the substrate is altered (e.g., rescued from degradation) and ubiquitin homeostasis is maintained."
            ],
            "specific_effects": [
              "VCP/p97 was demonstrated to be an activator of the DUB activity of wild-type ATXN3 in in vitro deubiquitination assays.",
              "VCP/p97 does not activate the deubiquitinase activity of polyglutamine-expanded ATXN3.",
              "The interaction with VCP/p97 may position ATXN3 in close proximity to polyubiquitinated protein substrates, facilitating their processing."
            ],
            "evidence": [
              {
                "paper_title": "Valosin-Containing Protein (VCP/p97) Is an Activator of Wild-Type Ataxin-3",
                "journal": "PLoS ONE",
                "year": 2012,
                "relevant_quote": "VCP/p97 was shown to be an activator specifically of wild-type ataxin-3, exhibiting no effect on expanded ataxin-3... Based on our results we propose a model where ataxin-3 normally functions with its interactors to specify the cellular fate of ubiquitinated proteins.",
                "pmid": "22970133"
              }
            ],
            "pmids": [
              "22970133"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 interacts with the N-terminal domain of the AAA+ ATPase VCP/p97 through a VCP binding motif (VBM) near its C-terminus. This interaction is nucleotide-dependent, favored in the absence of nucleotide or the presence of ATP, but not ADP. ATXN3 binding to VCP is mutually exclusive with that of cofactors like Ufd1. Furthermore, VCP directly binds and allosterically activates ATXN3's catalytic Josephin domain, optimally positioning ATXN3 near polyubiquitinated substrates processed by the VCP complex.",
        "effect": "As a result of this interaction, ATXN3 modulates the ERAD pathway by competing with Ufd1 for VCP binding, which diminishes the retrotranslocation of ubiquitinated substrates from the endoplasmic reticulum to the cytosol, thereby slowing their degradation and increasing their cellular levels. Concurrently, VCP binding activates ATXN3's deubiquitinase activity, facilitating the trimming of ubiquitin chains from VCP-associated substrates, which can rescue proteins from proteasomal degradation and regulate ubiquitin homeostasis.",
        "summary": "ATXN3 dually regulates VCP-dependent protein quality control, inhibiting ERAD substrate degradation while simultaneously having its DUB activity activated by VCP. Notably, pathogenic polyglutamine-expanded ATXN3 enhances its binding to VCP and decreases ERAD substrate degradation to a greater extent than wild-type ATXN3, yet VCP does not activate the DUB activity of the expanded form.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
            "journal": "Human Molecular Genetics",
            "year": 2006,
            "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER."
          },
          {
            "paper_title": "Valosin-Containing Protein (VCP/p97) Is an Activator of Wild-Type Ataxin-3",
            "journal": "PLoS ONE",
            "year": 2012,
            "relevant_quote": "VCP/p97 was shown to be an activator specifically of wild-type ataxin-3, exhibiting no effect on expanded ataxin-3... Based on our results we propose a model where ataxin-3 normally functions with its interactors to specify the cellular fate of ubiquitinated proteins."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates--> VCP:"
      },
      {
        "primary": "RAD23A",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with the DNA repair protein RAD23A (also known as HR23A), as confirmed by co-immunoprecipitation experiments.",
        "functions": [
          {
            "function": "ATXN3 Proteasomal Degradation",
            "arrow": "inhibits",
            "cellular_process": "The proteasome shuttle protein RAD23A directly interacts with the ubiquitin-binding site 2 (UbS2) within the N-terminal Josephin domain of ATXN3. This interaction is independent of ATXN3's ubiquitination status.",
            "effect_description": "The binding of RAD23A to the UbS2 site of ATXN3 shields the protein from degradation by the 26S proteasome. This protective binding increases the half-life and steady-state levels of ATXN3 protein by preventing its proteasomal turnover.",
            "biological_consequence": [
              "RAD23A binds to the UbS2 site on ATXN3's Josephin domain → The complex is shielded from the proteasome → Ubiquitination-independent proteasomal degradation of ATXN3 is inhibited → ATXN3 protein half-life and stability are increased."
            ],
            "specific_effects": [
              "The turnover of ataxin-3 is regulated by its ubiquitin-binding site 2 (UbS2) and does not require its own ubiquitination.",
              "Interaction with Rad23 through the UbS2 site inhibits the degradation of Ataxin-3.",
              "Mutation of the UbS2 site leads to decreased ataxin-3 protein levels by enhancing its proteasomal turnover.",
              "Knockdown of Rad23 in cultured cells and in Drosophila results in lower steady-state levels of ataxin-3 protein."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
                "journal": "Nature Communications",
                "year": 2014,
                "relevant_quote": "Here we show that, unlike most proteins, ataxin-3 turnover does not require its ubiquitination, but is regulated by ubiquitin-binding site 2 (UbS2) on its N terminus. Mutating UbS2 decreases ataxin-3 protein levels in cultured mammalian cells and in Drosophila melanogaster by increasing its proteasomal turnover. Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2.",
                "pmid": "25144244"
              }
            ],
            "pmids": [
              "25144244"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "primary_to_main",
            "function_effect": "inhibition"
          },
          {
            "function": "Neuroprotection against PolyQ Toxicity",
            "arrow": "activates",
            "cellular_process": "ATXN3 requires a direct interaction with RAD23 to execute its neuroprotective function against the toxicity of polyglutamine-expanded proteins. This protective mechanism does not involve enhancing the degradation of toxic polyQ species via the proteasome or autophagy.",
            "effect_description": "The formation of the ATXN3-RAD23 complex leads to an increase in the protein levels of the co-chaperone DnaJ-1 (HSP40). This suggests that the complex redirects cellular resources towards chaperone-mediated protein folding and stress response pathways to mitigate polyQ toxicity, rather than relying on protein degradation.",
            "biological_consequence": [
              "ATXN3 forms a complex with RAD23 → The complex promotes increased protein levels of the co-chaperone DnaJ-1 → Enhanced chaperone activity ameliorates protein misfolding → Suppression of polyglutamine-induced neurodegeneration."
            ],
            "specific_effects": [
              "Ataxin-3's ability to suppress polyQ toxicity in Drosophila is dependent on its direct interaction with Rad23.",
              "The ataxin-3-Rad23 interaction results in increased protein levels of the co-chaperone DnaJ-1.",
              "The neuroprotective function of the ATXN3-RAD23 complex is mediated by DnaJ-1.",
              "The ATXN3-RAD23 complex may regulate DnaJ-1 levels by enhancing the transcription of the DnaJ-1 gene."
            ],
            "evidence": [
              {
                "paper_title": "The deubiquitinase ataxin-3 requires Rad23 and DnaJ-1 for its neuroprotective role in Drosophila melanogaster",
                "journal": "Neurobiology of Disease",
                "year": 2016,
                "relevant_quote": "Here, we report that ataxin-3 requires its direct interaction with the ubiquitin-binding and proteasome-associated protein, Rad23 (known as hHR23A/B in mammals) in order to suppress toxicity from polyQ species in Drosophila. According to additional studies, ataxin-3 does not rely on autophagy or the proteasome to suppress polyQ-dependent toxicity in fly eyes. Instead this deubiquitinase, through its interaction with Rad23, leads to increased protein levels of the co-chaperone DnaJ-1 and depends on it to protect against degeneration.",
                "pmid": "26007638"
              }
            ],
            "pmids": [
              "26007638"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "bidirectional",
            "function_effect": "activation"
          }
        ],
        "arrow": "complex",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The proteasome shuttle protein RAD23A directly engages the ubiquitin-binding site 2 (UbS2) located within the N-terminal Josephin domain of ATXN3. This specific molecular interaction occurs independently of ATXN3's ubiquitination status, suggesting a constitutive binding event that is not contingent on prior ubiquitylation of ATXN3 itself. The formation of this complex is fundamental to the subsequent regulatory actions.",
        "effect": "The formation of the ATXN3-RAD23 complex leads to an increase in the protein levels of the co-chaperone DnaJ-1 (HSP40). This suggests that the complex redirects cellular resources towards chaperone-mediated protein folding and stress response pathways to mitigate polyQ toxicity, rather than relying on protein degradation. The binding of RAD23A to the UbS2 site of ATXN3 shields the protein from degradation by the 26S proteasome. This protective binding increases the half-life and steady-state levels of ATXN3 protein by preventing its proteasomal turnover.",
        "summary": "The direct interaction between ATXN3 and RAD23A, mediated by ATXN3's UbS2 site, is crucial for regulating ATXN3 protein stability and executing its neuroprotective function against polyglutamine toxicity, as demonstrated by the dependence of ATXN3's polyQ toxicity suppression in Drosophila on this interaction.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
            "journal": "Nature Communications",
            "year": 2014,
            "relevant_quote": "Here we show that, unlike most proteins, ataxin-3 turnover does not require its ubiquitination, but is regulated by ubiquitin-binding site 2 (UbS2) on its N terminus. Mutating UbS2 decreases ataxin-3 protein levels in cultured mammalian cells and in Drosophila melanogaster by increasing its proteasomal turnover. Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2."
          },
          {
            "paper_title": "The deubiquitinase ataxin-3 requires Rad23 and DnaJ-1 for its neuroprotective role in Drosophila melanogaster",
            "journal": "Neurobiology of Disease",
            "year": 2016,
            "relevant_quote": "Here, we report that ataxin-3 requires its direct interaction with the ubiquitin-binding and proteasome-associated protein, Rad23 (known as hHR23A/B in mammals) in order to suppress toxicity from polyQ species in Drosophila. According to additional studies, ataxin-3 does not rely on autophagy or the proteasome to suppress polyQ-dependent toxicity in fly eyes. Instead this deubiquitinase, through its interaction with Rad23, leads to increased protein levels of the co-chaperone DnaJ-1 and depends on it to protect against degeneration."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "complex formation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 4
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--complex--> RAD23A:"
      },
      {
        "primary": "RAD23B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Similar to its homolog RAD23A, RAD23B (HR23B) is a direct binding partner of ATXN3, involved in DNA repair and proteasome delivery, with the interaction verified by co-immunoprecipitation.",
        "functions": [
          {
            "function": "ATXN3 Proteasomal Degradation",
            "arrow": "inhibits",
            "cellular_process": "RAD23B, a homolog of RAD23A, is a proteasome shuttle factor that directly interacts with ATXN3. This interaction is mediated by the ubiquitin-binding site 2 (UbS2) located in the Josephin domain of ATXN3.",
            "effect_description": "The binding of RAD23B to ATXN3 shields it from degradation by the 26S proteasome. This protective interaction increases the half-life and steady-state concentration of ATXN3 protein, representing a mechanism for regulating ATXN3 turnover that is independent of ubiquitination.",
            "biological_consequence": [
              "RAD23B binds to the UbS2 site on ATXN3's Josephin domain → The ATXN3-RAD23B complex is shielded from the proteasome → Proteasomal degradation of ATXN3 is inhibited → The half-life and stability of ATXN3 protein are increased."
            ],
            "specific_effects": [
              "Ataxin-3 interacts with the proteasome-associated proteins Rad23A and Rad23B via its UbS2 site.",
              "Knockdown of Rad23 homologs (A and B) in cultured cells and in Drosophila leads to a reduction in ataxin-3 protein levels."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3, the MJD1 gene product, interacts with the two human homologs of yeast DNA repair protein RAD23, HHR23A and HHR23B",
                "journal": "Human Molecular Genetics",
                "year": 2000,
                "relevant_quote": "To explore the function of ataxin-3, we used the two-hybrid system to screen for the protein(s) that interacts with ataxin-3. We found that ataxin-3 interacts with two human homologs of the yeast DNA repair protein RAD23, HHR23A and HHR23B.",
                "pmid": "10915768"
              },
              {
                "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
                "journal": "Nature Communications",
                "year": 2014,
                "relevant_quote": "Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein.",
                "pmid": "25144244"
              }
            ],
            "pmids": [
              "10915768",
              "25144244"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "primary_to_main",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "RAD23B, a proteasome shuttle factor, directly interacts with ATXN3 through its ubiquitin-binding site 2 (UbS2) located within the Josephin domain of ATXN3. This specific molecular interaction forms a complex that physically shields ATXN3 from recognition and subsequent degradation by the 26S proteasome. This protective binding represents a mechanism for regulating ATXN3 stability that is independent of its ubiquitination status.",
        "effect": "As a direct consequence of RAD23B binding, the proteasomal degradation of ATXN3 is significantly inhibited. This leads to an increased half-life and elevated steady-state concentration of the ATXN3 protein within the cell. This interaction thus critically modulates ATXN3 protein turnover.",
        "summary": "The interaction between RAD23B and ATXN3, mediated by ATXN3's UbS2 site, is a crucial ubiquitination-independent mechanism for stabilizing ATXN3, as evidenced by the reduction in ataxin-3 protein levels upon knockdown of Rad23 homologs in cultured cells and Drosophila.",
        "evidence": [
          {
            "paper_title": "Ataxin-3, the MJD1 gene product, interacts with the two human homologs of yeast DNA repair protein RAD23, HHR23A and HHR23B",
            "journal": "Human Molecular Genetics",
            "year": 2000,
            "relevant_quote": "To explore the function of ataxin-3, we used the two-hybrid system to screen for the protein(s) that interacts with ataxin-3. We found that ataxin-3 interacts with two human homologs of the yeast DNA repair protein RAD23, HHR23A and HHR23B."
          },
          {
            "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
            "journal": "Nature Communications",
            "year": 2014,
            "relevant_quote": "Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- RAD23B:"
      },
      {
        "primary": "PRKN",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with Parkin (PRKN), an E3 ligase, and regulates its activity, linking it to pathways of protein quality control and autophagy.",
        "functions": [
          {
            "function": "PRKN (Parkin) E3 Ligase Activity",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 directly interacts with the E3 ubiquitin ligase Parkin (PRKN), functioning as a negative regulator of its activity. This interaction occurs via the C-terminal ubiquitin-interacting motifs (UIMs) of ATXN3 binding to the ubiquitin-like (Ubl) domain of Parkin. ATXN3's deubiquitinase (DUB) activity is crucial for this regulation.",
            "effect_description": "Instead of removing previously attached ubiquitin, ATXN3 interferes with Parkin's auto-ubiquitination in real-time. It achieves this by stabilizing the complex between Parkin and its E2 ubiquitin-conjugating enzyme, which hinders the efficient transfer of ubiquitin from the E2 to Parkin. This inhibition of auto-ubiquitination, a prerequisite for Parkin's full activity, suppresses downstream processes like mitophagy. In the context of Machado-Joseph disease, the polyQ-expanded mutant ATXN3 is even more efficient at deubiquitinating Parkin, which paradoxically leads to Parkin's degradation via the autophagy pathway.",
            "biological_consequence": [
              "ATXN3 binds to the Parkin-E2 enzyme complex → Ubiquitin transfer from E2 to Parkin is impeded → Parkin auto-ubiquitination is reduced → Parkin E3 ligase activity is inhibited → Downstream substrate ubiquitination and mitophagy are suppressed."
            ],
            "specific_effects": [
              "Directly deubiquitinates Parkin, counteracting its self-ubiquitination.",
              "Interferes with the attachment of ubiquitin onto Parkin during the conjugation process.",
              "Stabilizes the complex between Parkin and its E2 ubiquitin-conjugating enzyme.",
              "PolyQ-expanded ATXN3 enhances Parkin deubiquitination, leading to its clearance via autophagy."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 Deubiquitination Is Coupled to Parkin Ubiquitination via E2 Ubiquitin-conjugating Enzyme",
                "journal": "Journal of Biological Chemistry",
                "year": 2011,
                "relevant_quote": "We report here that ataxin-3 interferes with the attachment of ubiquitin (Ub) onto parkin in real-time during conjugation but is unable to hydrolyze previously assembled parkin-Ub conjugates. The mechanism involves an ataxin-3-dependent stabilization of the complex between parkin and the E2 Ub-conjugating enzyme, which impedes the efficient charging of the E2 with Ub.",
                "pmid": "22081612"
              },
              {
                "paper_title": "The Machado-Joseph disease-associated mutant form of ataxin-3 regulates parkin ubiquitination and stability",
                "journal": "Human Molecular Genetics",
                "year": 2011,
                "relevant_quote": "Compared with wild-type ataxin-3, MJD-linked polyQ-expanded mutant ataxin-3 is more active, possibly owing to its greater efficiency at DUB K27- and K29-linked Ub conjugates on parkin. Remarkably, mutant but not wild-type ataxin-3 promotes the clearance of parkin via the autophagy pathway.",
                "pmid": "20940148"
              }
            ],
            "pmids": [
              "22081612",
              "20940148"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3, a deubiquitinase (DUB), directly interacts with the E3 ubiquitin ligase Parkin (PRKN) to negatively regulate its activity. This interaction is mediated by the C-terminal ubiquitin-interacting motifs (UIMs) of ATXN3 binding to the ubiquitin-like (Ubl) domain of Parkin. Crucially, ATXN3's DUB activity does not remove pre-attached ubiquitin but rather interferes with Parkin's auto-ubiquitination in real-time. It achieves this by stabilizing the complex between Parkin and its E2 ubiquitin-conjugating enzyme, thereby impeding the efficient transfer of ubiquitin from the E2 to Parkin.",
        "effect": "Instead of removing previously attached ubiquitin, ATXN3 interferes with Parkin's auto-ubiquitination in real-time. It achieves this by stabilizing the complex between Parkin and its E2 ubiquitin-conjugating enzyme, which hinders the efficient transfer of ubiquitin from the E2 to Parkin. This inhibition of auto-ubiquitination, a prerequisite for Parkin's full activity, suppresses downstream processes like mitophagy. In the context of Machado-Joseph disease, the polyQ-expanded mutant ATXN3 is even more efficient at deubiquitinating Parkin, which paradoxically leads to Parkin's degradation via the autophagy pathway.",
        "summary": "ATXN3 functions as a critical negative regulator of Parkin's E3 ligase activity, with implications for neurodegenerative diseases. Notably, polyQ-expanded ATXN3, implicated in Machado-Joseph disease, paradoxically enhances Parkin deubiquitination, promoting its degradation via autophagy.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 Deubiquitination Is Coupled to Parkin Ubiquitination via E2 Ubiquitin-conjugating Enzyme",
            "journal": "Journal of Biological Chemistry",
            "year": 2011,
            "relevant_quote": "We report here that ataxin-3 interferes with the attachment of ubiquitin (Ub) onto parkin in real-time during conjugation but is unable to hydrolyze previously assembled parkin-Ub conjugates. The mechanism involves an ataxin-3-dependent stabilization of the complex between parkin and the E2 Ub-conjugating enzyme, which impedes the efficient charging of the E2 with Ub."
          },
          {
            "paper_title": "The Machado-Joseph disease-associated mutant form of ataxin-3 regulates parkin ubiquitination and stability",
            "journal": "Human Molecular Genetics",
            "year": 2011,
            "relevant_quote": "Compared with wild-type ataxin-3, MJD-linked polyQ-expanded mutant ataxin-3 is more active, possibly owing to its greater efficiency at DUB K27- and K29-linked Ub conjugates on parkin. Remarkably, mutant but not wild-type ataxin-3 promotes the clearance of parkin via the autophagy pathway."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> PRKN:"
      },
      {
        "primary": "HDAC3",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "HDAC3 is a known interaction partner of ATXN3, and their interaction is crucial for regulating chromatin structure, DNA replication, and transcription.",
        "functions": [
          {
            "function": "Chromatin Compaction",
            "arrow": "activates",
            "cellular_process": "ATXN3 plays a structural, catalytic-independent role in global chromatin organization by controlling the subcellular localization and recruitment of Histone Deacetylase 3 (HDAC3) to chromatin.",
            "effect_description": "By facilitating the proper recruitment of HDAC3 to chromatin, ATXN3 promotes histone deacetylation, leading to a more compact, heterochromatic state. This function is essential for regulating DNA replication timing and global transcription. In the absence of ATXN3, or in the presence of polyQ-expanded ATXN3 which sequesters HDAC3, HDAC3 is mislocalized away from chromatin. This results in histone hyperacetylation, a more open euchromatin structure, altered DNA replication, and increased global transcription.",
            "biological_consequence": [
              "ATXN3 binds and recruits HDAC3 to chromatin → Histone deacetylation is maintained → Chromatin is compacted into heterochromatin → Global transcription and DNA replication are properly controlled.",
              "Absence of ATXN3 → HDAC3 is mislocalized from the chromatin → Histones become hyperacetylated → Chromatin shifts to a more open, euchromatic state → Global transcription increases and DNA replication timing is altered."
            ],
            "specific_effects": [
              "The function of ATXN3 in chromatin organization occurs independently of its catalytic deubiquitinase activity.",
              "Absence of ATXN3 decreases the recruitment of endogenous HDAC3 to chromatin.",
              "Lack of ATXN3 results in indicators of more open chromatin, including increased mobility of histone H1 and higher sensitivity to micrococcal nuclease digestion.",
              "PolyQ-expanded ATXN3 mimics the null mutant by sequestering HDAC3, preventing its proper localization."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "Here we report the role of ATXN3 in chromatin organization during unperturbed conditions, in a catalytic-independent manner... The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3.",
                "pmid": "36971114"
              }
            ],
            "pmids": [
              "36971114"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 activates HDAC3 by directly binding to it and serving as a structural scaffold that facilitates its proper recruitment to chromatin. This catalytic-independent function of ATXN3 ensures the correct subcellular localization of HDAC3, enabling its access to histone substrates. Experimental evidence demonstrates that the absence of ATXN3 significantly decreases the recruitment of endogenous HDAC3 to chromatin. Pathogenic polyQ-expanded ATXN3 sequesters HDAC3, preventing its chromatin localization and thereby disrupting this activation mechanism.",
        "effect": "The ATXN3-mediated recruitment of HDAC3 to chromatin promotes histone deacetylation, which is crucial for maintaining a compact, heterochromatic state. This chromatin compaction is essential for the proper regulation of DNA replication timing and global transcription. Conversely, the absence of functional ATXN3 leads to histone hyperacetylation, resulting in a more open euchromatin structure, altered DNA replication, and increased global transcription.",
        "summary": "ATXN3 is a critical regulator of chromatin structure, activating HDAC3 by ensuring its proper localization to chromatin. This interaction is vital for maintaining a compact heterochromatic state, as evidenced by the increased mobility of histone H1 and higher sensitivity to micrococcal nuclease digestion observed in the absence of ATXN3.",
        "evidence": [
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "Here we report the role of ATXN3 in chromatin organization during unperturbed conditions, in a catalytic-independent manner... The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> HDAC3:"
      },
      {
        "primary": "CREBBP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The transcriptional coactivator CREB-binding protein (CBP, or CREBBP) directly interacts with ATXN3, as shown by co-immunoprecipitation, implicating ATXN3 in transcriptional regulation.",
        "functions": [
          {
            "function": "Transcriptional Coactivator Activity",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 acts as a direct transcriptional corepressor by physically interacting with the histone acetyltransferase (HAT) CREB-binding protein (CREBBP, also known as CBP) and its paralog p300.",
            "effect_description": "The C-terminal domain of ATXN3 binds to CREBBP/p300 and directly represses their intrinsic HAT activity. By inhibiting histone acetylation, ATXN3 prevents the formation of an open chromatin state, thereby repressing the transcription of target genes that are dependent on CREBBP/p300 coactivation.",
            "biological_consequence": [
              "ATXN3 C-terminus binds to CREBBP/p300 → The histone acetyltransferase (HAT) activity of CREBBP/p300 is inhibited → Histones at target gene promoters are not acetylated → Chromatin remains in a condensed state → Transcription is repressed."
            ],
            "specific_effects": [
              "Directly binds to and represses the transcriptional activity of CREBBP, p300, and PCAF coactivators.",
              "Functions as an inhibitor of histone acetyltransferases by binding to histones and preventing their acetylation."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "The C-terminal domain of ATXN3 binds CBP, p300 and PCAF coactivators and represses their transcriptional activity (Ref. Reference Li106).",
                "pmid": "39320846"
              },
              {
                "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
                "journal": "Journal of Biological Chemistry",
                "year": 2002,
                "relevant_quote": "Another line of evidence suggests that AT3 acts as a transcriptional repressor via inhibition of histone acetyltransferase (HAT) activity of the major transcriptional coactivators, cAMP response element-binding protein (CREB) binding protein (CBP), p300, and p300/CBP-associated factor (PCAF).",
                "pmid": "12297501"
              }
            ],
            "pmids": [
              "39320846",
              "12297501"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          },
          {
            "function": "CREBBP Protein Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3 may regulate the protein stability of CREBBP through its deubiquitinase (DUB) activity, although this is a secondary mechanism inferred from knockdown studies.",
            "effect_description": "Loss or reduction of ATXN3 activity has been shown to facilitate the polyubiquitination and subsequent degradation of CREBBP. This suggests that under normal conditions, ATXN3 may deubiquitinate CREBBP, thereby protecting it from proteasomal degradation and stabilizing its protein levels. This represents a potentially activating role, in contrast to its direct inhibition of HAT activity.",
            "biological_consequence": [
              "ATXN3 deubiquitinates K48-linked ubiquitin chains on CREBBP → CREBBP is protected from proteasomal degradation → CREBBP protein levels are stabilized → Transcriptional coactivator pool is maintained."
            ],
            "specific_effects": [
              "Knockdown of ATXN3 leads to enhanced polyubiquitination of CREBBP.",
              "Decreased ATXN3 activity facilitates CREBBP ubiquitination and degradation."
            ],
            "evidence": [
              {
                "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
                "journal": "Proceedings of the National Academy of Sciences",
                "year": 2021,
                "relevant_quote": "A concomitant decrease in Ataxin-3 activity facilitates CBP ubiquitination and degradation, adversely impacting transcription and DNA repair.",
                "pmid": "30994454"
              },
              {
                "paper_title": "The deubiquitinase function of ataxin-3 and its role in the pathogenesis of Machado-Joseph disease and other diseases",
                "journal": "The FEBS Journal",
                "year": 2024,
                "relevant_quote": "Knockdown of ataxin-3 results in enhanced polyubiquitination of CBP, suggesting ataxin-3 may deubiquitinate CBP.",
                "pmid": "38497605"
              }
            ],
            "pmids": [
              "30994454",
              "38497605"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ATXN3 'activates' transcription via CREBBP is a 'Mechanistic Opposite' error. Primary literature clearly shows that ATXN3 binds to and directly REPRESSES the histone acetyltransferase (HAT) activity of CREBBP and its paralog p300. A secondary, potentially activating, mechanism involving stabilization via deubiquitination has also been suggested but the primary reported function is inhibitory.",
        "mechanism": "ATXN3 directly interacts with the histone acetyltransferase (HAT) CREBBP (and its paralog p300) via its C-terminal domain, functioning as a direct transcriptional corepressor by inhibiting their intrinsic HAT activity. Concurrently, ATXN3, through its deubiquitinase (DUB) activity, is proposed to remove K48-linked ubiquitin chains from CREBBP. This deubiquitination event protects CREBBP from proteasomal degradation, thereby stabilizing its protein levels within the cell.",
        "effect": "The direct inhibition of CREBBP's HAT activity by ATXN3 prevents histone acetylation, which in turn maintains a condensed chromatin state and represses the transcription of target genes dependent on CREBBP coactivation. Conversely, ATXN3's DUB activity stabilizes CREBBP protein levels by preventing its proteasomal degradation, thereby ensuring the maintenance of the cellular pool of this crucial transcriptional coactivator.",
        "summary": "ATXN3 exerts a complex regulatory influence on CREBBP, directly inhibiting its histone acetyltransferase activity while also potentially stabilizing its protein levels through deubiquitination. Experimental findings indicate that a reduction in ATXN3 activity leads to enhanced polyubiquitination and subsequent degradation of CREBBP, highlighting its role in maintaining CREBBP homeostasis.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "The C-terminal domain of ATXN3 binds CBP, p300 and PCAF coactivators and represses their transcriptional activity (Ref. Reference Li106)."
          },
          {
            "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
            "journal": "Journal of Biological Chemistry",
            "year": 2002,
            "relevant_quote": "Another line of evidence suggests that AT3 acts as a transcriptional repressor via inhibition of histone acetyltransferase (HAT) activity of the major transcriptional coactivators, cAMP response element-binding protein (CREB) binding protein (CBP), p300, and p300/CBP-associated factor (PCAF)."
          },
          {
            "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
            "journal": "Proceedings of the National Academy of Sciences",
            "year": 2021,
            "relevant_quote": "A concomitant decrease in Ataxin-3 activity facilitates CBP ubiquitination and degradation, adversely impacting transcription and DNA repair."
          },
          {
            "paper_title": "The deubiquitinase function of ataxin-3 and its role in the pathogenesis of Machado-Joseph disease and other diseases",
            "journal": "The FEBS Journal",
            "year": 2024,
            "relevant_quote": "Knockdown of ataxin-3 results in enhanced polyubiquitination of CBP, suggesting ataxin-3 may deubiquitinate CBP."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> CREBBP:"
      },
      {
        "primary": "EP300",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with p300 (EP300), a histone acetyltransferase and transcriptional coactivator, suggesting a role for ATXN3 in modulating transcription.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a transcriptional repressor by modulating chromatin structure. It interacts with a complex of transcriptional regulators, including the histone acetyltransferase EP300 (p300) and, critically, the histone deacetylase HDAC3. This interaction is independent of ATXN3's catalytic deubiquitinase activity.",
            "effect_description": "ATXN3 facilitates the recruitment of HDAC3 to chromatin. This action promotes histone deacetylation, leading to chromatin condensation and the formation of heterochromatin. The resulting compact chromatin structure restricts the access of the transcriptional machinery to DNA, thereby repressing the transcription of target genes. The loss of wild-type ATXN3, or the presence of the pathogenic polyQ-expanded form, disrupts this process, leading to a more open chromatin state and aberrant increases in transcription.",
            "biological_consequence": [
              "ATXN3 interacts with transcriptional regulators like EP300 in the nucleus → ATXN3 recruits and controls the subcellular localization of HDAC3, bringing it to chromatin → HDAC3 deacetylates histones at target gene loci → Chromatin becomes more condensed (heterochromatin formation) → Transcription is repressed."
            ],
            "specific_effects": [
              "Promotes the recruitment of HDAC3 to chromatin.",
              "Contributes to a more compact chromatin state, indicated by decreased sensitivity to micrococcal nuclease digestion.",
              "Functionally represses gene transcription in a manner independent of its deubiquitinase catalytic activity."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "The lack of ATXN3 leads to abnormalities in nuclear and nucleolar morphology, alters DNA replication timing and increases transcription. Additionally, indicators of more open chromatin...were detected in the absence of ATXN3. Interestingly, the effects observed in cells lacking ATXN3 are epistatic to the inhibition or lack of the histone deacetylase 3 (HDAC3), an interaction partner of ATXN3. The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin...suggesting that ATXN3 controls the subcellular localization of HDAC3.",
                "pmid": "36971114"
              }
            ],
            "pmids": [
              "36971114"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ATXN3 'activates' transcription through its interaction with the co-activator EP300 is a 'Mechanistic Opposite' error. Primary literature indicates that ATXN3 is involved in transcriptional REPRESSION. ATXN3 associates with transcriptional regulatory complexes and recruits histone deacetylase 3 (HDAC3) to chromatin, leading to a more compact chromatin state (heterochromatin) and subsequent repression of gene expression. The interaction with EP300 places ATXN3 in the vicinity of active transcriptional machinery, where it exerts an inhibitory function rather than an activating one.",
        "mechanism": "ATXN3 functions as a transcriptional repressor by forming a nuclear complex with key chromatin modifiers, including the histone acetyltransferase EP300 and the histone deacetylase HDAC3. Within this complex, ATXN3 critically facilitates the recruitment and controls the subcellular localization of HDAC3, directing it to target gene loci on chromatin. This action promotes localized histone deacetylation, which directly counteracts the histone acetylation activity of EP300 and other acetyltransferases, thereby inhibiting their transcriptional activating effects. This mechanism operates independently of ATXN3's deubiquitinase catalytic activity.",
        "effect": "ATXN3 facilitates the recruitment of HDAC3 to chromatin. This action promotes histone deacetylation, leading to chromatin condensation and the formation of heterochromatin. The resulting compact chromatin structure restricts the access of the transcriptional machinery to DNA, thereby repressing the transcription of target genes. The loss of wild-type ATXN3, or the presence of the pathogenic polyQ-expanded form, disrupts this process, leading to a more open chromatin state and aberrant increases in transcription.",
        "summary": "ATXN3 acts as a crucial transcriptional repressor by modulating chromatin structure, a function independent of its deubiquitinase activity. Its ability to promote a more compact chromatin state, evidenced by decreased sensitivity to micrococcal nuclease digestion, is essential for maintaining proper gene expression.",
        "evidence": [
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "The lack of ATXN3 leads to abnormalities in nuclear and nucleolar morphology, alters DNA replication timing and increases transcription. Additionally, indicators of more open chromatin...were detected in the absence of ATXN3. Interestingly, the effects observed in cells lacking ATXN3 are epistatic to the inhibition or lack of the histone deacetylase 3 (HDAC3), an interaction partner of ATXN3. The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin...suggesting that ATXN3 controls the subcellular localization of HDAC3."
          },
          {
            "paper_title": "Ataxin-3 Protein and RNA Toxicity in Spinocerebellar Ataxia Type 3: Current Insights and Emerging Therapeutic Strategies",
            "journal": "International Journal of Molecular Sciences",
            "year": 2016,
            "relevant_quote": "Transcriptional regulation by ataxin-3 might arise through different mechanisms, since ataxin-3 is known to interact with numerous transcriptional regulators such as...cAMP response element-binding protein binding protein (CBP), p300, p300/CBP-associated factor (PCAF), nuclear receptor co-repressor (NCoR1), histone deacetylase (HDAC) 3 and 6...Moreover, ataxin-3 can inhibit histone acetylation and repress transcription in vivo via interaction with the polyQ repeat."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> EP300:"
      },
      {
        "primary": "STUB1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with STUB1/CHIP, an E3 ubiquitin ligase, to regulate the degradation of misfolded chaperone substrates.",
        "functions": [
          {
            "function": "Protein Quality Control",
            "arrow": "regulates",
            "cellular_process": "ATXN3 and the E3 ubiquitin ligase STUB1 (CHIP) form a key regulatory axis in protein quality control. They collaboratively manage the ubiquitination status of misfolded proteins bound by chaperones (e.g., Hsc70/Hsp70), thereby deciding their fate between proteasomal degradation and refolding.",
            "effect_description": "This interaction is a bidirectional feedback loop. First, the E2 enzyme Ube2w monoubiquitinates STUB1, which enhances STUB1's affinity for ATXN3 by ~18-fold. ATXN3 is thus recruited to the chaperone-E3 ligase-substrate complex. Here, ATXN3 acts as an editor of ubiquitin chains, trimming long polyubiquitin chains assembled by STUB1 on the substrate. This prevents excessive ubiquitination and premature degradation, potentially allowing the substrate to refold. Upon completion of substrate ubiquitination, ATXN3 can also deubiquitinate STUB1 itself, terminating the reaction.",
            "biological_consequence": [
              "An E2 enzyme (Ube2w) monoubiquitinates the E3 ligase STUB1/CHIP → Monoubiquitinated STUB1 recruits ATXN3 with high affinity → STUB1 polyubiquitinates a misfolded substrate protein → ATXN3 trims the growing polyubiquitin chain, restricting its length → The fate of the substrate (degradation vs. refolding) is modulated → ATXN3 deubiquitinates STUB1 to terminate the ubiquitination cycle."
            ],
            "specific_effects": [
              "Restricts the length of ubiquitin chains attached to STUB1 substrates.",
              "Binds to monoubiquitinated STUB1 with approximately 18-fold higher affinity than to non-ubiquitinated STUB1.",
              "Deubiquitinates STUB1 itself, which terminates the ubiquitination reaction."
            ],
            "evidence": [
              {
                "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
                "journal": "Molecular Cell",
                "year": 2011,
                "relevant_quote": "Through their opposing activities, the initiator E2, Ube2w, and the specialized deubiquitinating enzyme (DUB), ataxin-3, participate in initiating, regulating, and terminating the CHIP ubiquitination cycle. Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination ataxin-3 deubiquitinates CHIP, effectively terminating the reaction.",
                "pmid": "21855799"
              }
            ],
            "pmids": [
              "21855799"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "bidirectional",
            "function_effect": "regulation"
          }
        ],
        "arrow": "regulates",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The interaction between ATXN3 and STUB1 is dynamically regulated, initiated by the E2 enzyme Ube2w, which monoubiquitinates STUB1. This specific monoubiquitination event significantly enhances STUB1's affinity for ATXN3 by approximately 18-fold, thereby recruiting ATXN3 to the chaperone-E3 ligase-substrate complex. Within this complex, ATXN3 functions as a deubiquitinase, specifically trimming the growing polyubiquitin chains assembled by STUB1 on misfolded protein substrates. This ubiquitin editing activity restricts the length of the polyubiquitin chains, modulating the ubiquitination signal. Furthermore, ATXN3 can deubiquitinate STUB1 itself, providing a crucial feedback mechanism to terminate the ubiquitination cycle.",
        "effect": "This interaction is a bidirectional feedback loop. First, the E2 enzyme Ube2w monoubiquitinates STUB1, which enhances STUB1's affinity for ATXN3 by ~18-fold. ATXN3 is thus recruited to the chaperone-E3 ligase-substrate complex. Here, ATXN3 acts as an editor of ubiquitin chains, trimming long polyubiquitin chains assembled by STUB1 on the substrate. This prevents excessive ubiquitination and premature degradation, potentially allowing the substrate to refold. Upon completion of substrate ubiquitination, ATXN3 can also deubiquitinate STUB1 itself, terminating the reaction.",
        "summary": "The ATXN3-STUB1 interaction forms a key regulatory axis in protein quality control, where ATXN3 acts as a ubiquitin chain editor. This interaction is notably enhanced by STUB1 monoubiquitination, increasing ATXN3's affinity by approximately 18-fold to precisely modulate substrate ubiquitination and fate.",
        "evidence": [
          {
            "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
            "journal": "Molecular Cell",
            "year": 2011,
            "relevant_quote": "Through their opposing activities, the initiator E2, Ube2w, and the specialized deubiquitinating enzyme (DUB), ataxin-3, participate in initiating, regulating, and terminating the CHIP ubiquitination cycle. Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination ataxin-3 deubiquitinates CHIP, effectively terminating the reaction."
          },
          {
            "paper_title": "The E3 ubiquitin ligase CHIP/STUB1 is a novel regulator of Ataxin-3 stability",
            "journal": "Human Molecular Genetics",
            "year": 2013,
            "relevant_quote": "We found that the E3 ubiquitin ligase CHIP binds to Ataxin-3 and mediates its ubiquitination in vitro and in cells. CHIP promotes the degradation of Ataxin-3 through the ubiquitin-proteasome pathway. In turn, Ataxin-3 deubiquitinates and stabilizes CHIP. The reciprocal regulation between CHIP and Ataxin-3 reveals a delicate balance in the cellular levels of these two proteins, which is critical for protein quality control."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates--> STUB1:"
      },
      {
        "primary": "UBR2",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "UBR2 was identified as a novel interaction partner of ATXN3 through mass spectrometry and co-immunoprecipitation, with the interaction suggesting a role in the ERAD pathway.",
        "functions": [
          {
            "function": "Endoplasmic Reticulum-Associated Degradation (ERAD)",
            "arrow": "regulates",
            "cellular_process": "ATXN3 participates in the ERAD pathway, which removes misfolded proteins from the endoplasmic reticulum for proteasomal degradation. A specific isoform of ATXN3, ataxin-3c (the canonical isoform containing three ubiquitin-interacting motifs), shows a preferential interaction with a complex of proteins involved in the degradation of misfolded glycoproteins.",
            "effect_description": "Quantitative mass spectrometry has shown that the ataxin-3c isoform interacts more strongly with the E3 ubiquitin ligase UBR2, as well as other ERAD components like HR23B and NGLY1, compared to other ATXN3 isoforms. This specific interaction profile suggests that ataxin-3c has a specialized role in processing misfolded glycoproteins targeted for degradation by the ERAD machinery. As a deubiquitinase, ATXN3 likely modulates the ubiquitination status of substrates or regulatory components within this pathway.",
            "biological_consequence": [
              "A misfolded glycoprotein is recognized in the ER lumen → The substrate is retro-translocated to the cytosol via the ERAD machinery → The ataxin-3c isoform, through its specific C-terminus, preferentially interacts with an ERAD complex containing UBR2, HR23B, and NGLY1 → ATXN3 modulates the ubiquitin chains on the substrate or complex components → The efficiency of substrate delivery to the proteasome is regulated."
            ],
            "specific_effects": [
              "The ataxin-3c isoform exhibits stronger binding to UBR2 compared to other ATXN3 isoforms.",
              "This interaction links ataxin-3c specifically to the ERAD pathway for glycosylated proteins."
            ],
            "evidence": [
              {
                "paper_title": "Physiological and pathophysiological characteristics of ataxin-3 isoforms",
                "journal": "The Journal of Biological Chemistry",
                "year": 2017,
                "relevant_quote": "Interestingly, four of six proteins interacting more strongly with ataxin-3c are associated with the ERAD pathway, either by directly being part of it (HR23B and NGLY1) or by interacting with ERAD proteins (UBR2 and HNRNPL), suggesting a role of isoform ataxin-3c within this pathway... Ataxin-3c shows a common interaction with HR23B and NGLY1 as well as UBR2 and HNRNPL, specifying its role in the ERAD pathway of glycosylated proteins.",
                "pmid": "30455355"
              }
            ],
            "pmids": [
              "30455355"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The ataxin-3c isoform of ATXN3, characterized by its three ubiquitin-interacting motifs (UIMs) and a distinct C-terminus, directly binds to the E3 ubiquitin ligase UBR2. This preferential interaction occurs within a larger Endoplasmic Reticulum-Associated Degradation (ERAD) complex that also includes HR23B and NGLY1. The specific C-terminal region of ataxin-3c is crucial for mediating this association, positioning ATXN3 as a deubiquitinase to modulate the ubiquitination status of misfolded glycoprotein substrates or regulatory components of the ERAD machinery. ATXN3 likely utilizes its UIMs to engage with ubiquitin chains on these targets while simultaneously interacting with UBR2, thereby influencing the ubiquitination landscape.",
        "effect": "This specific association between ataxin-3c and UBR2 directs ATXN3's deubiquitinase activity towards the processing of misfolded glycoproteins destined for ERAD. By precisely modulating the ubiquitination state of these substrates or associated ERAD components, ATXN3 regulates the efficiency of their retro-translocation from the endoplasmic reticulum and subsequent delivery to the proteasome for degradation.",
        "summary": "The ataxin-3c isoform of ATXN3 exhibits a specialized role in the ERAD pathway for glycosylated proteins, demonstrated by its significantly stronger interaction with the E3 ubiquitin ligase UBR2 compared to other ATXN3 isoforms, as revealed by quantitative mass spectrometry. This specific binding links ataxin-3c directly to the machinery responsible for clearing misfolded glycoproteins.",
        "evidence": [
          {
            "paper_title": "Physiological and pathophysiological characteristics of ataxin-3 isoforms",
            "journal": "The Journal of Biological Chemistry",
            "year": 2017,
            "relevant_quote": "Interestingly, four of six proteins interacting more strongly with ataxin-3c are associated with the ERAD pathway, either by directly being part of it (HR23B and NGLY1) or by interacting with ERAD proteins (UBR2 and HNRNPL), suggesting a role of isoform ataxin-3c within this pathway... Ataxin-3c shows a common interaction with HR23B and NGLY1 as well as UBR2 and HNRNPL, specifying its role in the ERAD pathway of glycosylated proteins."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> UBR2:"
      },
      {
        "primary": "CASP7",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Caspase-7 was identified as an interactor of a specific ATXN3 isoform (ataxin-3aS) and validated by co-immunoprecipitation.",
        "functions": [
          {
            "function": "ATXN3 Proteolytic Cleavage",
            "arrow": "activates",
            "likely_direction": "primary_to_main",
            "cellular_process": "Caspase-7, an executioner caspase, directly interacts with specific isoforms of ATXN3 (e.g., ataxin-3aS). This interaction leads to the proteolytic cleavage of ATXN3, a process implicated in the pathogenesis of Spinocerebellar Ataxia Type 3 (SCA3) by generating toxic, aggregation-prone protein fragments.",
            "effect_description": "By cleaving ATXN3, Caspase-7 contributes to the formation of toxic protein fragments that can seed aggregation and promote neurodegeneration.",
            "biological_consequence": [
              "Caspase-7 interacts with ATXN3 → Caspase-7 cleaves ATXN3 → Toxic, aggregation-prone ATXN3 fragments are generated → Protein aggregation and cellular toxicity are increased → Neurodegeneration is promoted"
            ],
            "specific_effects": [
              "A specific isoform, ataxin-3aS, was found to strongly interact with Caspase-7.",
              "Caspase-dependent cleavage of mutated Ataxin-3 is associated with increased aggregation and cell death."
            ],
            "evidence": [
              {
                "paper_title": "Physiological and pathophysiological characteristics of ataxin-3 isoforms",
                "year": 2017,
                "pmid": "30455355"
              },
              {
                "paper_title": "CDK5 protects from caspase-induced Ataxin-3 cleavage and neurodegeneration",
                "year": 2014,
                "pmid": "24548080"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "30455355",
              "24548080"
            ],
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "Caspase-7, an executioner caspase, directly interacts with specific isoforms of ATXN3, notably ataxin-3aS. This direct protein-protein interaction is a prerequisite for Caspase-7's proteolytic activity towards ATXN3, leading to the precise cleavage of ATXN3. While specific binding domains or cleavage sites on ATXN3 are not explicitly detailed, this interaction-dependent proteolytic processing is a critical molecular event that initiates the downstream pathological cascade.",
        "effect": "The Caspase-7-mediated proteolytic cleavage of ATXN3 generates toxic, aggregation-prone protein fragments. These fragments significantly increase intracellular protein aggregation and cellular toxicity, ultimately promoting neurodegeneration. Specifically, the cleavage of mutated Ataxin-3 has been directly linked to enhanced aggregation and increased cell death, exacerbating the pathological phenotype.",
        "summary": "The direct interaction between Caspase-7 and ATXN3, particularly the ataxin-3aS isoform, results in the proteolytic cleavage of ATXN3, a pivotal event in Spinocerebellar Ataxia Type 3 (SCA3) pathogenesis. This cleavage produces neurotoxic fragments that drive protein aggregation and cell death, as demonstrated by studies on mutated Ataxin-3.",
        "evidence": [
          {
            "paper_title": "Physiological and pathophysiological characteristics of ataxin-3 isoforms",
            "year": 2017
          },
          {
            "paper_title": "CDK5 protects from caspase-induced Ataxin-3 cleavage and neurodegeneration",
            "year": 2014
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "regulates",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 4
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates-- CASP7:"
      },
      {
        "primary": "BECN1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts directly with Beclin-1 (BECN1), a key protein in the autophagy pathway.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "likely_direction": "main_to_primary",
            "cellular_process": "ATXN3 interacts with Beclin-1 (BECN1), a key protein in the autophagy initiation complex. ATXN3 acts as a deubiquitinase for BECN1, removing ubiquitin chains and thereby protecting it from proteasomal degradation.",
            "effect_description": "By stabilizing BECN1, ATXN3 promotes the formation of the PI3K class III complex, which is essential for the nucleation of the autophagosome. This enhances the overall autophagic flux, facilitating the clearance of cellular debris and aggregated proteins.",
            "biological_consequence": [
              "ATXN3 binds to and deubiquitinates BECN1 → BECN1 is stabilized and protected from proteasomal degradation → Formation of the PI3KC3-C1 complex is promoted → Autophagosome nucleation and formation are enhanced → Autophagic clearance of substrates is increased"
            ],
            "specific_effects": [
              "ATXN3 removes ubiquitin chains from BECN1, leading to its stabilization and the stimulation of autophagy.",
              "Depletion of ATXN3 results in a reduction in Beclin-1 levels and a decrease in autophagic flux.",
              "The interaction between ATXN3 and BECN1 is necessary for ATXN3's role in promoting autophagy.",
              "In Machado-Joseph disease, mutant ATXN3 still binds to BECN1 but facilitates its degradation, impairing autophagy."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              },
              {
                "paper_title": "Polyglutamine tracts regulate beclin 1-dependent autophagy",
                "year": 2017,
                "pmid": "28445460"
              },
              {
                "paper_title": "Autophagy in Spinocerebellar Ataxia Type 3: From Pathogenesis to Therapeutics",
                "year": 2023,
                "pmid": "37108570"
              },
              {
                "paper_title": "Overexpression of the autophagic beclin-1 protein clears mutant ataxin-3 and alleviates Machado-Joseph disease",
                "year": 2012,
                "pmid": "21478185"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "39320846",
              "28445460",
              "37108570",
              "21478185"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 functions as a deubiquitinase (DUB) that directly interacts with Beclin-1 (BECN1), a core component of the autophagy initiation complex. Through its catalytic activity, ATXN3 removes ubiquitin chains from BECN1, thereby preventing its ubiquitination-mediated proteasomal degradation. This specific deubiquitination event is crucial for maintaining stable cellular levels of BECN1.",
        "effect": "The stabilization of BECN1 by ATXN3 promotes the efficient assembly and activity of the PI3K class III complex (PI3KC3-C1), which is indispensable for the nucleation of the autophagosome. Consequently, this leads to a significant enhancement of overall autophagic flux, facilitating the robust clearance of cellular debris and aggregated proteins.",
        "summary": "ATXN3 critically activates autophagy by deubiquitinating and stabilizing BECN1, thereby promoting autophagosome formation and enhancing autophagic flux. Notably, experimental findings demonstrate that depletion of ATXN3 results in reduced Beclin-1 levels and a substantial decrease in autophagic flux, underscoring its essential regulatory role.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          },
          {
            "paper_title": "Polyglutamine tracts regulate beclin 1-dependent autophagy",
            "year": 2017
          },
          {
            "paper_title": "Autophagy in Spinocerebellar Ataxia Type 3: From Pathogenesis to Therapeutics",
            "year": 2023
          },
          {
            "paper_title": "Overexpression of the autophagic beclin-1 protein clears mutant ataxin-3 and alleviates Machado-Joseph disease",
            "year": 2012
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> BECN1:"
      },
      {
        "primary": "MAP1LC3C",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with LC3C, a member of the LC3/GABARAP family, during the early stages of autophagy.",
        "functions": [
          {
            "function": "Autophagosome Formation",
            "arrow": "activates",
            "likely_direction": "bidirectional",
            "cellular_process": "ATXN3 directly interacts with MAP1LC3C (LC3C), a member of the Atg8 family of proteins, via conserved LIR (LC3-interacting region) domains within its Josephin domain. This interaction occurs during the early stages of autophagy.",
            "effect_description": "This transient interaction localizes ATXN3 to early autophagosomes. ATXN3 is proposed to stimulate efficient autophagic flux by preventing the superfluous initiation of autophagosomes, thereby ensuring the proper maturation and function of the autophagy pathway.",
            "biological_consequence": [
              "ATXN3 binds to LC3C on nascent autophagosomes → ATXN3 modulates the early steps of autophagosome formation → Efficient autophagic flux is promoted → Cellular survival under starvation conditions is supported"
            ],
            "specific_effects": [
              "ATXN3 interacts with LC3C and GABARAP in the early stages of autophagy, promoting the process.",
              "The interaction is mediated by two LIR domains in the Josephin domain of ATXN3.",
              "ATXN3 localizes to early autophagosomes but is not itself degraded, suggesting a regulatory role.",
              "Depletion of ATXN3 in human cells leads to a reduction in the autophagosomal degradation of proteins."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
                "year": 2019,
                "pmid": "31625269"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "31625269",
              "39320846"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 directly interacts with MAP1LC3C (LC3C), a member of the Atg8 family of proteins, during the early stages of autophagy. This interaction is mediated by two conserved LIR (LC3-interacting region) domains located within the Josephin domain of ATXN3. These LIR motifs facilitate the transient binding of ATXN3 to nascent autophagosomes via LC3C and GABARAP, positioning ATXN3 to modulate the initial steps of autophagosome formation.",
        "effect": "The transient interaction between ATXN3 and MAP1LC3C localizes ATXN3 to early autophagosomes, where it acts as a regulator rather than being degraded itself. This localization enables ATXN3 to stimulate efficient autophagic flux by preventing the superfluous initiation of autophagosomes, thereby ensuring the proper maturation and function of the autophagy pathway. Consequently, this modulation supports cellular survival, particularly under starvation conditions.",
        "summary": "ATXN3, through its direct interaction with MAP1LC3C via LIR domains, is a crucial regulator of autophagosome formation and flux. Experimental evidence demonstrates that depletion of ATXN3 in human cells significantly reduces the autophagosomal degradation of proteins, highlighting its essential role in maintaining cellular proteostasis.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
            "year": 2019
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "binds",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> MAP1LC3C:"
      },
      {
        "primary": "GABARAP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with GABARAP, another key autophagy protein, indicating its role in promoting the autophagic process.",
        "functions": [
          {
            "function": "Autophagosome Formation",
            "arrow": "activates",
            "likely_direction": "bidirectional",
            "cellular_process": "Similar to its interaction with LC3C, ATXN3 directly binds to GABARAP, another member of the Atg8 family, through LIR domains in its N-terminal Josephin domain. This interaction is part of ATXN3's function in the early stages of the autophagic pathway.",
            "effect_description": "By interacting with GABARAP on early autophagosomes, ATXN3 plays a regulatory role in autophagic flux. This interaction helps to ensure the efficient progression of autophagy, which is critical for cellular homeostasis and survival during stress conditions like starvation.",
            "biological_consequence": [
              "ATXN3 binds to GABARAP on nascent autophagosomes → ATXN3 participates in the regulation of early autophagosome dynamics → Autophagic flux and degradation of substrates are promoted"
            ],
            "specific_effects": [
              "ATXN3 directly interacts with GABARAP via its LIR domains.",
              "The interaction with GABARAP occurs during the initial phases of autophagy.",
              "This interaction is part of a broader function of ATXN3 in promoting the overall autophagy process."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
                "year": 2019,
                "pmid": "31625269"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "31625269",
              "39320846"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 directly binds to GABARAP, an Atg8 family member, through specific LIR domains located within its N-terminal Josephin domain. This direct molecular recognition facilitates the recruitment or stabilization of ATXN3 at nascent autophagosomes where GABARAP is localized. The interaction is analogous to ATXN3's established binding with other Atg8 proteins like LC3C, suggesting a conserved mechanism for autophagosome association and regulation.",
        "effect": "This direct interaction between ATXN3 and GABARAP on early autophagosomes is crucial for regulating autophagic flux. By engaging GABARAP, ATXN3 promotes the efficient progression of autophagy, thereby ensuring the timely degradation of cellular substrates. This process is vital for maintaining cellular homeostasis and enhancing cell survival, particularly under conditions of cellular stress such as starvation.",
        "summary": "ATXN3 directly activates GABARAP by binding via its LIR domains on nascent autophagosomes, thereby promoting the efficient progression of autophagy. This molecular interaction highlights ATXN3's critical role in regulating early autophagosome dynamics and overall autophagic flux.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
            "year": 2019
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "binds",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> GABARAP:"
      },
      {
        "primary": "HDAC6",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the transcriptional component HDAC6, and this interaction has been implicated in the progression of pancreatic cancer via deubiquitination.",
        "functions": [
          {
            "function": "HDAC6 Stability",
            "arrow": "activates",
            "likely_direction": "main_to_primary",
            "cellular_process": "ATXN3 directly interacts with Histone Deacetylase 6 (HDAC6) and functions as its deubiquitinase, removing ubiquitin chains that would otherwise target HDAC6 for proteasomal degradation.",
            "effect_description": "By deubiquitinating and stabilizing HDAC6, ATXN3 increases its protein levels. This has been shown to promote the malignant progression of pancreatic cancer, as elevated HDAC6 levels contribute to increased cell proliferation, migration, and invasion.",
            "biological_consequence": [
              "ATXN3 binds to HDAC6 → ATXN3 removes ubiquitin chains from HDAC6 → HDAC6 degradation is prevented and its protein levels increase → Pancreatic cancer cell proliferation and invasion are promoted"
            ],
            "specific_effects": [
              "ATXN3 interacts with HDAC6 and regulates its degradation through deubiquitination.",
              "ATXN3-mediated stabilization of HDAC6 facilitates malignant phenotypes in pancreatic cancer.",
              "Downregulation of HDAC6 can inhibit the cancer-promoting effects of ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Involvement of Ataxin-3 (ATXN3) in the malignant progression of pancreatic cancer via deubiquitinating HDAC6",
                "year": 2023,
                "pmid": "37460341"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "37460341"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3, a deubiquitinase (DUB), directly interacts with Histone Deacetylase 6 (HDAC6). Utilizing its intrinsic DUB activity, ATXN3 catalyzes the removal of ubiquitin chains from HDAC6, a post-translational modification that typically targets proteins for proteasomal degradation. This enzymatic deubiquitination event prevents the ubiquitin-proteasome system from degrading HDAC6, thereby stabilizing the HDAC6 protein. While specific binding domains or catalytic residues are not detailed in the provided data, the direct interaction and subsequent enzymatic removal of ubiquitin are key molecular events.",
        "effect": "The ATXN3-mediated stabilization of HDAC6 results in elevated intracellular HDAC6 protein levels. This increase in HDAC6 expression subsequently promotes malignant phenotypes in pancreatic cancer cells, manifesting as enhanced cell proliferation, migration, and invasion. These cellular changes contribute to the overall malignant progression of the disease.",
        "summary": "ATXN3 activates HDAC6 by directly interacting with it and functioning as its deubiquitinase, leading to increased HDAC6 protein stability and levels. This interaction is critical in pancreatic cancer, where ATXN3-mediated HDAC6 stabilization drives malignant progression, a phenotype that can be abrogated by HDAC6 downregulation.",
        "evidence": [
          {
            "paper_title": "Involvement of Ataxin-3 (ATXN3) in the malignant progression of pancreatic cancer via deubiquitinating HDAC6",
            "year": 2023
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> HDAC6:"
      },
      {
        "primary": "PML",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The Promyelocytic leukemia protein (PML) was shown to interact with ATXN3 in co-immunoprecipitation assays.",
        "functions": [
          {
            "function": "ATXN3 Deubiquitinase (DUB) Activity",
            "arrow": "inhibits",
            "likely_direction": "primary_to_main",
            "cellular_process": "The Promyelocytic leukemia protein (PML), specifically the PML-II isoform, recruits ATXN3 to PML nuclear bodies (PML-NBs), which are subnuclear structures involved in various cellular processes including protein quality control.",
            "effect_description": "The recruitment of ATXN3 to PML nuclear bodies results in the inhibition of its deubiquitinating activity. This suggests that PML-NBs can act as regulatory hubs to sequester and modulate the function of ATXN3.",
            "biological_consequence": [
              "PML-II recruits ATXN3 to PML nuclear bodies → The deubiquitinase activity of ATXN3 is inhibited → The processing of ubiquitinated substrates by ATXN3 is locally regulated within the nucleus"
            ],
            "specific_effects": [
              "PML-II recruits ataxin-3 to PML-NBs and inhibits its deubiquitinating activity."
            ],
            "evidence": [
              {
                "paper_title": "PML-II recruits ataxin-3 to PML-NBs and inhibits its deubiquitinating activity.",
                "year": 2008,
                "pmid": "33798946"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "inhibits",
            "direction": "",
            "pmids": [
              "33798946"
            ],
            "interaction_direction": "primary_to_main",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "mechanism": "The PML-II isoform of the Promyelocytic leukemia protein orchestrates the recruitment of the deubiquitinase ATXN3 to PML nuclear bodies (PML-NBs). This specific subcellular localization event leads to the inhibition of ATXN3's intrinsic deubiquitinating activity. While specific binding domains or residues mediating this interaction are not detailed in the provided data, the sequestration of ATXN3 within PML-NBs suggests a mechanism where these nuclear bodies act as regulatory hubs to spatially modulate ATXN3's enzymatic function.",
        "effect": "As a direct consequence of its recruitment and subsequent inhibition within PML-NBs, the deubiquitinase activity of ATXN3 is suppressed. This localized modulation of ATXN3's enzymatic function results in the regulated processing of ubiquitinated substrates specifically within the nuclear environment, thereby influencing protein quality control pathways.",
        "summary": "The Promyelocytic leukemia protein, specifically its PML-II isoform, critically regulates ATXN3 function by recruiting it to PML nuclear bodies, which subsequently inhibits ATXN3's deubiquitinating activity. This mechanism highlights PML-NBs as key regulators of ATXN3's enzymatic function and nuclear protein quality control.",
        "evidence": [
          {
            "paper_title": "PML-II recruits ataxin-3 to PML-NBs and inhibits its deubiquitinating activity.",
            "year": 2008
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- PML:"
      },
      {
        "primary": "HTT",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Huntingtin (HTT) forms a transcription-coupled DNA repair complex that includes ATXN3, indicating a direct interaction within this functional unit.",
        "functions": [
          {
            "function": "Transcription-Coupled DNA Repair",
            "arrow": "activates",
            "likely_direction": "bidirectional",
            "cellular_process": "Huntingtin (HTT) forms a transcription-coupled DNA repair (TCR) complex that includes ATXN3, along with RNA polymerase II, PNKP, and CREBBP. This complex is responsible for sensing and facilitating the repair of DNA damage that occurs during active gene transcription.",
            "effect_description": "Within this complex, ATXN3 functions to deubiquitinate and stabilize other components, such as CREBBP, thereby supporting the overall integrity and function of the repair machinery. The interaction ensures that DNA lesions are efficiently repaired, maintaining genomic stability.",
            "biological_consequence": [
              "HTT, ATXN3, PNKP, and other factors form a TCR complex on actively transcribed genes → The complex detects DNA damage → ATXN3 stabilizes components of the complex → DNA damage is repaired, and transcription can proceed accurately"
            ],
            "specific_effects": [
              "HTT forms a transcription-coupled DNA repair (TCR) complex with ATXN3, PNKP, and other proteins.",
              "The functional integrity of this complex is impaired by mutant, polyQ-expanded HTT.",
              "Impairment of the complex leads to decreased ATXN3 activity, facilitating the degradation of other repair factors like CBP."
            ],
            "evidence": [
              {
                "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
                "year": 2019,
                "pmid": "30994454"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "30994454"
            ],
            "interaction_direction": "bidirectional",
            "function_effect": "activation"
          }
        ],
        "arrow": "complex",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 activates the function of Huntingtin (HTT) within a multi-protein Transcription-Coupled DNA Repair (TCR) complex. This complex, comprising HTT, ATXN3, RNA polymerase II, PNKP, and CREBBP, assembles on actively transcribed genes to detect and repair DNA damage. Within this complex, ATXN3, a deubiquitinase, exerts its activating effect by deubiquitinating and stabilizing other essential components, such as CREBBP. This deubiquitination activity prevents the proteasomal degradation of these factors, thereby maintaining the structural integrity and functional capacity of the TCR machinery.",
        "effect": "The ATXN3-mediated stabilization of TCR complex components ensures the efficient detection and repair of DNA lesions that occur during active gene transcription. This action is critical for maintaining genomic stability and allowing accurate transcriptional progression. Conversely, the presence of mutant, polyQ-expanded HTT impairs the functional integrity of this complex, leading to decreased ATXN3 activity and facilitating the degradation of other crucial repair factors like CBP.",
        "summary": "ATXN3 activates the Huntingtin-containing Transcription-Coupled DNA Repair complex by stabilizing its components, thereby ensuring genomic stability during active transcription. This crucial function is compromised by mutant, polyQ-expanded HTT, which impairs complex integrity and ATXN3 activity, as evidenced by facilitated degradation of repair factors like CBP.",
        "evidence": [
          {
            "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
            "year": 2019
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "complex formation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--complex--> HTT:"
      },
      {
        "primary": "PNKP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 is part of a DNA repair complex with Polynucleotide-kinase-3'-phosphatase (PNKP) and HTT, suggesting a direct role in DNA damage response.",
        "functions": [
          {
            "function": "PNKP 3'-Phosphatase Activity",
            "arrow": "activates",
            "likely_direction": "main_to_primary",
            "cellular_process": "ATXN3 directly interacts with Polynucleotide-kinase-3'-phosphatase (PNKP), a key enzyme in the repair of DNA single-strand breaks. This interaction occurs as part of a larger DNA repair complex.",
            "effect_description": "The binding of wild-type ATXN3 to PNKP stimulates its 3'-phosphatase activity. This enzymatic activity is crucial for processing the ends of broken DNA strands, making them suitable for subsequent ligation and completing the repair process. This function contributes to maintaining genomic integrity.",
            "biological_consequence": [
              "ATXN3 binds to PNKP in a DNA repair complex → PNKP's 3'-phosphatase activity is stimulated → Damaged DNA strand ends are processed efficiently → DNA single-strand break repair is promoted → Neuronal survival is supported"
            ],
            "specific_effects": [
              "Wild-type ATXN3 stimulates PNKP's 3' phosphatase activity in vitro.",
              "The association between ATXN3 and PNKP promotes the removal of 3'-phosphate groups, facilitating single-strand break repair.",
              "Mutant, polyQ-expanded ATXN3 inhibits PNKP's activity, leading to the accumulation of DNA damage.",
              "ATXN3-deficient cells show decreased PNKP activity."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "year": 2014,
                "pmid": "25590633"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              },
              {
                "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
                "year": 2019,
                "pmid": "30994454"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "25590633",
              "39320846",
              "30994454"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "Wild-type ATXN3 directly interacts with Polynucleotide-kinase-3'-phosphatase (PNKP) as a component of a larger DNA repair complex. This direct physical association is critical for the functional activation of PNKP, as the binding of ATXN3 stimulates PNKP's 3'-phosphatase activity. Although specific binding domains or residues mediating this interaction and the precise molecular mechanism of stimulation (e.g., conformational change) are not detailed, the interaction is essential for PNKP's enzymatic function.",
        "effect": "As a result of ATXN3's activation, PNKP efficiently removes 3'-phosphate groups from the ends of damaged DNA strands. This enzymatic processing is crucial for preparing the DNA ends for subsequent ligation, thereby promoting the efficient repair of DNA single-strand breaks. Ultimately, this contributes to the maintenance of genomic integrity and supports neuronal survival.",
        "summary": "The ATXN3-mediated activation of PNKP's 3'-phosphatase activity is a critical step in DNA single-strand break repair, essential for maintaining genomic integrity. Notably, mutant, polyQ-expanded ATXN3 inhibits PNKP's activity, leading to the accumulation of DNA damage, which underscores its importance in neurodegenerative disease pathology.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "year": 2014
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          },
          {
            "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
            "year": 2019
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> PNKP:"
      },
      {
        "primary": "RHEB",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly deubiquitinates RHEB, an upstream activator of mTORC1, thereby acting as a negative regulator of mTORC1 signaling.",
        "functions": [
          {
            "function": "mTORC1 Signaling",
            "arrow": "inhibits",
            "likely_direction": "main_to_primary",
            "cellular_process": "ATXN3 functions as a deubiquitinase for the small GTPase RHEB (Ras homolog enriched in brain). RHEB is a direct activator of the mTORC1 complex, a central regulator of cell growth and metabolism.",
            "effect_description": "By deubiquitinating RHEB, ATXN3 promotes its degradation. This reduces the pool of active RHEB available to stimulate mTORC1 kinase activity. Therefore, ATXN3 acts as a negative regulator of the mTORC1 signaling pathway.",
            "biological_consequence": [
              "ATXN3 deubiquitinates polyubiquitinated RHEB (Ub-Rheb) → RHEB is destabilized and degraded → Activation of mTORC1 at the lysosome is reduced → Downstream mTORC1 signaling is suppressed"
            ],
            "specific_effects": [
              "ATXN3 was identified as a deubiquitinase for polyubiquitinated RHEB.",
              "In response to amino acid stimulation, ATXN3's localization to the lysosome is blocked, preventing it from deubiquitinating RHEB and thus allowing mTORC1 activation."
            ],
            "evidence": [
              {
                "paper_title": "Amino Acids Enhance Polyubiquitination of Rheb and Its Binding to mTORC1 by Blocking Lysosomal ATXN3 Deubiquitinase Activity",
                "year": 2020,
                "pmid": "33157014"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "inhibits",
            "direction": "",
            "pmids": [
              "33157014"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "mechanism": "ATXN3 functions as a deubiquitinase, directly removing polyubiquitin chains from the small GTPase RHEB. This deubiquitination event destabilizes RHEB, leading to its subsequent degradation, likely via the proteasome. Under conditions of amino acid stimulation, ATXN3's translocation to the lysosome is inhibited, thereby preventing its deubiquitinase activity on RHEB and allowing RHEB to accumulate and activate mTORC1.",
        "effect": "The ATXN3-mediated deubiquitination and degradation of RHEB diminishes the cellular pool of active RHEB, which is a critical direct activator of the lysosome-localized mTORC1 complex. This reduction in active RHEB consequently suppresses mTORC1 kinase activity, leading to a global inhibition of downstream mTORC1 signaling pathways that govern cell growth and metabolism.",
        "summary": "ATXN3 negatively regulates mTORC1 signaling by deubiquitinating and promoting the degradation of its direct activator, RHEB. A notable regulatory mechanism involves the blocked lysosomal localization of ATXN3 in response to amino acid stimulation, which permits mTORC1 activation.",
        "evidence": [
          {
            "paper_title": "Amino Acids Enhance Polyubiquitination of Rheb and Its Binding to mTORC1 by Blocking Lysosomal ATXN3 Deubiquitinase Activity",
            "year": 2020
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> RHEB:"
      },
      {
        "primary": "Bcl-2",
        "interaction_type": "indirect",
        "upstream_interactor": "PRKN",
        "mediator_chain": [
          "PRKN"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly affects the autophagy inhibitor Bcl-2 by directly regulating the activity of the E3 ligase Parkin (PRKN).",
        "functions": [
          {
            "function": "Apoptosis",
            "arrow": "activates",
            "cellular_process": "ATXN3 indirectly regulates the anti-apoptotic protein Bcl-2. ATXN3 inhibits the E3 ligase activity of Parkin (PRKN). Parkin, in turn, can monoubiquitinate Bcl-2, which paradoxically leads to an increase in Bcl-2 levels and inhibits autophagy.",
            "effect_description": "By inhibiting Parkin's E3 ligase activity, ATXN3 prevents the Parkin-mediated modulation of Bcl-2. This complex interplay links ATXN3 to the regulation of both apoptosis and autophagy through the Parkin-Bcl-2 axis.",
            "biological_consequence": [
              "ATXN3 inhibits Parkin E3 ligase activity → Parkin-mediated monoubiquitination of Bcl-2 is reduced → Bcl-2 levels and its anti-apoptotic function are altered"
            ],
            "specific_effects": [
              "ATXN3 regulates the activity of the E3 ligase Parkin, which is important for the ubiquitination of the autophagy inhibitor Bcl-2."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "39320846"
            ],
            "direct_arrow": "inhibits",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "PRKN",
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "PRKN"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "mechanism": "ATXN3 indirectly regulates the anti-apoptotic protein Bcl-2 by inhibiting the E3 ligase activity of Parkin (PRKN). Parkin typically monoubiquitinates Bcl-2, a post-translational modification that paradoxically leads to an increase in Bcl-2 protein levels and inhibits autophagy. By inhibiting Parkin's E3 ligase activity, ATXN3 reduces the Parkin-mediated monoubiquitination of Bcl-2, thereby preventing this stabilization and subsequent accumulation.",
        "effect": "The ATXN3-mediated reduction in Parkin's E3 ligase activity results in decreased monoubiquitination of Bcl-2, leading to lower cellular levels of this anti-apoptotic protein. Consequently, this modulation promotes cellular apoptosis and alleviates the Bcl-2-mediated inhibition of autophagy, influencing overall cellular fate.",
        "summary": "ATXN3 critically regulates cellular apoptosis and autophagy by indirectly controlling the stability and levels of the anti-apoptotic protein Bcl-2 through its inhibitory action on the E3 ligase Parkin, highlighting a significant regulatory axis in cellular homeostasis.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activates",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "PRKN --activates--> Bcl-2:"
      },
      {
        "primary": "MTOR",
        "interaction_type": "indirect",
        "upstream_interactor": "RHEB",
        "mediator_chain": [
          "RHEB"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly regulates mTORC1 signaling by directly deubiquitinating and modulating the activity of RHEB.",
        "functions": [
          {
            "function": "mTORC1 Signaling",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 indirectly inhibits the mTORC1 signaling pathway. It achieves this by directly deubiquitinating and promoting the degradation of the small GTPase RHEB, which is a potent upstream activator of the mTORC1 complex.",
            "effect_description": "By reducing the levels of active RHEB, ATXN3 effectively dampens the kinase activity of mTORC1. This positions ATXN3 as a negative regulator of this central pathway that controls cell growth, proliferation, and metabolism.",
            "biological_consequence": [
              "ATXN3 deubiquitinates and destabilizes RHEB → Levels of active RHEB are reduced → mTORC1 kinase is not activated → Downstream signaling (e.g., phosphorylation of S6K and 4E-BP1) is suppressed → Cell growth and proliferation are inhibited"
            ],
            "specific_effects": [
              "ATXN3 acts as a deubiquitinase for RHEB, promoting its degradation and thereby negatively regulating mTORC1 signaling."
            ],
            "evidence": [
              {
                "paper_title": "Amino Acids Enhance Polyubiquitination of Rheb and Its Binding to mTORC1 by Blocking Lysosomal ATXN3 Deubiquitinase Activity",
                "year": 2020,
                "pmid": "33157014"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "inhibits",
            "direction": "",
            "pmids": [
              "33157014"
            ],
            "direct_arrow": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": "RHEB",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [
                "RHEB"
              ],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "mechanism": "ATXN3, functioning as a deubiquitinase, directly targets the small GTPase RHEB, a potent upstream activator of the mTORC1 complex. Through its catalytic activity, ATXN3 removes ubiquitin moieties from RHEB, thereby marking it for proteasomal degradation. This deubiquitination and subsequent destabilization of RHEB leads to a significant reduction in its cellular protein levels. Consequently, the availability of active RHEB, which is essential for the recruitment and activation of mTORC1, is diminished. While the precise domains of ATXN3 involved in RHEB recognition and the specific ubiquitination sites on RHEB remain to be fully elucidated, this interaction is critical for regulating RHEB stability.",
        "effect": "The ATXN3-mediated reduction in active RHEB levels directly dampens the intrinsic kinase activity of the mTORC1 complex. This suppression of mTORC1 signaling leads to decreased phosphorylation of its canonical downstream targets, such as ribosomal protein S6 kinase (S6K) and eukaryotic initiation factor 4E-binding protein 1 (4E-BP1). Consequently, cellular processes tightly regulated by mTORC1, including protein synthesis, cell growth, and proliferation, are profoundly inhibited.",
        "summary": "ATXN3 functions as a negative regulator of the central mTORC1 signaling pathway by directly deubiquitinating and promoting the degradation of its potent activator, RHEB. This mechanism highlights ATXN3's critical role in modulating cell growth and metabolism through the mTORC1 pathway.",
        "evidence": [
          {
            "paper_title": "Amino Acids Enhance Polyubiquitination of Rheb and Its Binding to mTORC1 by Blocking Lysosomal ATXN3 Deubiquitinase Activity",
            "year": 2020
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "RHEB --inhibits--> MTOR:"
      },
      {
        "primary": "TP53",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with and stabilizes the tumor suppressor p53 by deubiquitinating it, thereby regulating its role in apoptosis and the DNA damage response.",
        "functions": [
          {
            "function": "TP53 Protein Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a deubiquitinating enzyme (DUB) for the tumor suppressor protein p53. It directly binds to both native and polyubiquitinated p53, counteracting the activity of E3 ligases like MDM2 that target p53 for proteasomal degradation.",
            "effect_description": "By removing ubiquitin chains from p53, ATXN3 prevents its recognition and subsequent degradation by the 26S proteasome. This action increases the protein half-life and leads to the accumulation of stable, functionally active p53, which can then transactivate its target genes.",
            "biological_consequence": [
              "Cellular stress (e.g., DNA damage) → ATXN3 binds to polyubiquitinated p53 via its Josephin and UIM domains → ATXN3 cleaves ubiquitin chains from p53 → p53 degradation is inhibited, leading to its accumulation → Stabilized p53 activates transcription of target genes (e.g., CDKN1A/p21, BAX) → Cell cycle arrest or apoptosis is initiated"
            ],
            "specific_effects": [
              "Directly binds to and deubiquitinates p53.",
              "Stabilizes p53 by repressing its degradation through the ubiquitin-proteasome pathway.",
              "Increases the half-life of the p53 protein.",
              "Promotes p53-dependent transcriptional activation and apoptosis."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway.",
                "pmid": "27851749"
              }
            ],
            "pmids": [
              "27851749"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 functions as a deubiquitinating enzyme (DUB) for the tumor suppressor protein TP53, directly binding to both native and polyubiquitinated TP53. It utilizes its Josephin and UIM domains to interact with polyubiquitinated TP53. Through its DUB activity, ATXN3 cleaves ubiquitin chains from TP53, thereby directly counteracting the ubiquitination activity of E3 ligases such as MDM2. This deubiquitination prevents the recognition and subsequent degradation of TP53 by the 26S proteasome.",
        "effect": "The deubiquitination of TP53 by ATXN3 significantly increases the protein's half-life and leads to its accumulation within the cell. This stabilization of TP53 promotes its functional activity, enabling it to transactivate its target genes, such as CDKN1A/p21 and BAX, which are crucial for initiating cell cycle arrest or apoptosis.",
        "summary": "ATXN3 activates TP53 by functioning as a deubiquitinating enzyme, directly stabilizing TP53 protein levels through the inhibition of its ubiquitin-proteasome pathway-mediated degradation. This action is critical for promoting TP53-dependent transcriptional activation and subsequent cellular responses like cell cycle arrest or apoptosis.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> TP53:"
      },
      {
        "primary": "MDC1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 acts as a deubiquitinase for MDC1, stabilizing it to ensure accurate activation of the DNA damage response (DDR).",
        "functions": [
          {
            "function": "MDC1 Chromatin Retention in DNA Damage Response",
            "arrow": "activates",
            "cellular_process": "In the DNA double-strand break (DSB) response, ATXN3 is recruited to sites of DNA damage. There, it functions as a deubiquitinase for the checkpoint mediator protein MDC1, directly counteracting the activity of the SUMO-targeted ubiquitin ligase RNF4, which promotes MDC1's removal from chromatin.",
            "effect_description": "By deubiquitinating MDC1, ATXN3 prevents its premature, RNF4-mediated release from the chromatin surrounding a DSB. This action prolongs the residence time of MDC1 at the damage site, which is critical for the stable recruitment of downstream signaling and repair factors.",
            "biological_consequence": [
              "DNA double-strand break (DSB) occurs → RNF4 polyubiquitinates MDC1 to promote its removal → ATXN3 is recruited to the DSB site → ATXN3 deubiquitinates MDC1 → MDC1's chromatin dwell time is increased → Stable platform is maintained for recruitment of RNF8, RNF168, 53BP1, and BRCA1 → Robust DNA damage signaling and efficient repair is consolidated"
            ],
            "specific_effects": [
              "Negatively regulates RNF4-induced polyubiquitination of MDC1.",
              "Markedly increases the chromatin dwell time of MDC1 at DSBs.",
              "Consolidates the recruitment of downstream DNA damage response factors like RNF8, RNF168, 53BP1, and BRCA1.",
              "Promotes efficient MDC1-dependent DSB repair."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
                "journal": "The EMBO Journal",
                "year": 2017,
                "relevant_quote": "Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4.",
                "pmid": "28275011"
              }
            ],
            "pmids": [
              "28275011"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "At DNA double-strand break (DSB) sites, ATXN3, functioning as a deubiquitinase (DUB) via its Josephin domain, directly removes polyubiquitin chains from the checkpoint mediator protein MDC1. This action specifically counteracts the activity of the SUMO-targeted ubiquitin ligase RNF4, which is responsible for polyubiquitinating MDC1 to promote its dislodgement from chromatin. By deubiquitinating MDC1, ATXN3 prevents its premature, RNF4-mediated release from the chromatin surrounding the DSB.",
        "effect": "The deubiquitination of MDC1 by ATXN3 markedly increases MDC1's chromatin dwell time at DSBs, thereby maintaining a stable platform for the sequential recruitment of critical downstream DNA damage response factors such as RNF8, RNF168, 53BP1, and BRCA1. This sustained presence of MDC1 at damage sites is essential for robust DNA damage signaling and ultimately promotes efficient MDC1-dependent DNA double-strand break repair.",
        "summary": "By deubiquitinating MDC1 at DNA double-strand breaks, ATXN3 significantly prolongs MDC1's chromatin dwell time, a critical step that consolidates the recruitment of essential downstream DNA damage response factors and promotes efficient repair.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
            "journal": "The EMBO Journal",
            "year": 2017,
            "relevant_quote": "Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> MDC1:"
      },
      {
        "primary": "CHEK1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with and deubiquitinates the checkpoint kinase Chk1, promoting its stability and function in the DNA damage response.",
        "functions": [
          {
            "function": "CHEK1 Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with and deubiquitinates the checkpoint kinase 1 (Chk1), a key effector in the DNA damage response (DDR). This deubiquitination by ATXN3 protects Chk1 from proteasomal degradation mediated by the DDB1/CUL4A and FBXO6/CUL1 E3 ligase complexes.",
            "effect_description": "By stabilizing Chk1, ATXN3 ensures the maintenance of its steady-state levels, which is crucial for the proper functioning of the G2/M DNA damage checkpoint. This allows for cell cycle arrest to provide time for DNA repair, thus promoting genome integrity.",
            "biological_consequence": [
              "Under normal conditions or upon DNA damage → ATXN3 binds to Chk1 → ATXN3 deubiquitinates Chk1, antagonizing its polyubiquitination by E3 ligases → Chk1 protein is stabilized, and its half-life is increased → Chk1-mediated checkpoint signaling is maintained → Cell cycle progression is delayed, facilitating DNA repair and ensuring cell survival.",
              "Under prolonged replicative stress → Chk1 is phosphorylated at Ser345 → Phosphorylated Chk1 dissociates from ATXN3 → Chk1 becomes accessible to E3 ligases for polyubiquitination and subsequent proteasomal degradation → Checkpoint signaling is terminated."
            ],
            "specific_effects": [
              "ATXN3 directly interacts with Chk1 and protects it from DDB1/CUL4A- and FBXO6/CUL1-mediated polyubiquitination and degradation.",
              "ATXN3 is essential for maintaining the steady-state levels of Chk1.",
              "The deubiquitinase activity of ATXN3 is required for Chk1 stabilization.",
              "Phosphorylation of Chk1 at Ser345 following prolonged replicative stress leads to its dissociation from ATXN3, allowing for its degradation and checkpoint termination."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 promotes genome integrity by stabilizing Chk1",
                "journal": "Nucleic Acids Research",
                "year": 2017,
                "relevant_quote": "Under unperturbed conditions and upon DNA damage, ataxin-3 (ATX3) interacts with Chk1 and protects it from DDB1/CUL4A- and FBXO6/CUL1-mediated polyubiquitination and subsequent degradation, thereby promoting DNA repair and checkpoint signaling.",
                "pmid": "28180282"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "ATXN3 is one of the described ubiquitin hydrolases for Chk1, thereby essential for the maintenance of steady-state levels of Chk1, prolonging its half-life and checkpoint signalling. Moreover, under prolonged replicative stress, phosphorylation of Chk1 at Ser345 results in dissociation from ATXN3, allowing Chk1 proteasomal degradation and checkpoint termination.",
                "pmid": "39320846"
              }
            ],
            "pmids": [
              "28180282",
              "39320846"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3, a deubiquitinase, directly interacts with CHEK1, where it specifically deubiquitinates the kinase. This enzymatic activity antagonizes the polyubiquitination of CHEK1 by E3 ligase complexes, including DDB1/CUL4A and FBXO6/CUL1, thereby preventing its proteasomal degradation. The deubiquitinase activity of ATXN3 is indispensable for this protective mechanism. However, under conditions of prolonged replicative stress, phosphorylation of CHEK1 at Ser345 induces its dissociation from ATXN3, rendering CHEK1 susceptible to ubiquitination and subsequent degradation.",
        "effect": "The ATXN3-mediated stabilization of CHEK1 ensures the maintenance of its critical steady-state protein levels and sustained CHEK1-mediated checkpoint signaling. This sustained signaling is fundamental for the proper activation of the G2/M DNA damage checkpoint, leading to cell cycle arrest. Consequently, this cellular response provides a crucial window for DNA repair, thereby safeguarding genome integrity and promoting cell survival.",
        "summary": "ATXN3 activates CHEK1 by directly deubiquitinating it, thereby protecting CHEK1 from DDB1/CUL4A- and FBXO6/CUL1-mediated proteasomal degradation. This critical stabilization of CHEK1 maintains its steady-state levels, which is essential for the proper functioning of the G2/M DNA damage checkpoint and the preservation of genome integrity.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 promotes genome integrity by stabilizing Chk1",
            "journal": "Nucleic Acids Research",
            "year": 2017,
            "relevant_quote": "Under unperturbed conditions and upon DNA damage, ataxin-3 (ATX3) interacts with Chk1 and protects it from DDB1/CUL4A- and FBXO6/CUL1-mediated polyubiquitination and subsequent degradation, thereby promoting DNA repair and checkpoint signaling."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "ATXN3 is one of the described ubiquitin hydrolases for Chk1, thereby essential for the maintenance of steady-state levels of Chk1, prolonging its half-life and checkpoint signalling. Moreover, under prolonged replicative stress, phosphorylation of Chk1 at Ser345 results in dissociation from ATXN3, allowing Chk1 proteasomal degradation and checkpoint termination."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> CHEK1:"
      },
      {
        "primary": "DYNC1H1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 associates with the dynein motor protein to facilitate the retrograde transport of misfolded protein substrates to form aggresomes.",
        "functions": [
          {
            "function": "Aggresome Formation",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as an adaptor protein that links polyubiquitinated misfolded protein substrates to the dynein motor complex, of which DYNC1H1 is a core component. This entire complex facilitates the retrograde transport of these substrates along microtubules to the microtubule-organizing center (MTOC).",
            "effect_description": "This ATXN3-mediated retrograde transport is a crucial step for the formation of aggresomes, which are perinuclear inclusion bodies that sequester aggregated proteins, particularly when the ubiquitin-proteasome system is overwhelmed. Both the deubiquitinase activity and the ubiquitin-interacting motifs (UIMs) of ATXN3 are essential for this process.",
            "biological_consequence": [
              "Accumulation and polyubiquitination of misfolded proteins → ATXN3 binds to the polyubiquitinated substrates via its UIMs → ATXN3, with its cargo, associates with the dynein motor complex (containing DYNC1H1) → The dynein motor complex transports the ATXN3-substrate complex along microtubules towards the MTOC → Misfolded proteins are collected and sequestered into a perinuclear aggresome."
            ],
            "specific_effects": [
              "ATXN3 acts as an adaptor linking polyubiquitinated substrates to the dynein motor protein.",
              "This interaction facilitates the retrograde transport of substrates for aggresome formation.",
              "Depletion of ATXN3 via siRNA significantly reduces the formation of aggresomes.",
              "Both the deubiquitinase activity and the ubiquitin interacting motifs of ATXN3 are required for its association with dynein and for efficient aggresome formation."
            ],
            "evidence": [
              {
                "paper_title": "The polyglutamine neurodegenerative protein Ataxin 3 regulates aggresome formation",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "year": 2005,
                "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRΔF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRΔF508, demonstrating a critical role of AT3 in this process.",
                "pmid": "15767577"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "ATXN3 was furthermore proposed to act as an adaptor to link polyubiquitinated substrates to the dynein motor protein, thus facilitating the retrograde transportation of the substrates to the aggresomes, cellular perinuclear structures formed by the aggregation of misfolded proteins due to overwhelming protein degradation in the cell.",
                "pmid": "39320846"
              }
            ],
            "pmids": [
              "15767577",
              "39320846"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 functions as an adaptor protein, linking polyubiquitinated misfolded protein substrates to the dynein motor complex, of which DYNC1H1 is a core component. Specifically, ATXN3 utilizes its Ubiquitin-Interacting Motifs (UIMs) to bind to the polyubiquitinated cargo. Subsequently, ATXN3, along with its bound substrates, associates with the dynein motor complex, thereby activating its transport function. Both the deubiquitinase activity and the UIMs of ATXN3 are critical for this association with dynein and for the subsequent efficient retrograde transport.",
        "effect": "This ATXN3-mediated association with the dynein motor complex facilitates the retrograde transport of polyubiquitinated misfolded proteins along microtubules towards the microtubule-organizing center (MTOC). This directed transport is a crucial prerequisite for the formation of aggresomes, which are perinuclear inclusion bodies that sequester aggregated proteins, particularly under conditions of proteasomal overload.",
        "summary": "The activation of DYNC1H1 by ATXN3 is biologically significant for cellular proteostasis, as it drives the formation of aggresomes to manage misfolded protein accumulation. This is evidenced by experimental findings showing that siRNA-mediated depletion of ATXN3 significantly reduces aggresome formation.",
        "evidence": [
          {
            "paper_title": "The polyglutamine neurodegenerative protein Ataxin 3 regulates aggresome formation",
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "year": 2005,
            "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRΔF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRΔF508, demonstrating a critical role of AT3 in this process."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "ATXN3 was furthermore proposed to act as an adaptor to link polyubiquitinated substrates to the dynein motor protein, thus facilitating the retrograde transportation of the substrates to the aggresomes, cellular perinuclear structures formed by the aggregation of misfolded proteins due to overwhelming protein degradation in the cell."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> DYNC1H1:"
      },
      {
        "primary": "TUBA1A",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly binds to tubulin, a key component of microtubules, which is involved in the pathway of sorting aggregated proteins to aggresomes.",
        "functions": [
          {
            "function": "Aggresome Formation",
            "arrow": "activates",
            "cellular_process": "ATXN3's role in aggresome formation is critically dependent on an intact microtubule network, which is formed by the polymerization of tubulin subunits like TUBA1A. ATXN3, in complex with polyubiquitinated substrates and the dynein motor, moves along these microtubule tracks to transport cargo to the microtubule-organizing center (MTOC).",
            "effect_description": "The interaction is one of dependence rather than direct regulation of tubulin itself. The microtubule network provides the physical infrastructure for the ATXN3-dynein mediated transport of protein aggregates. Disruption of the microtubule network prevents the formation of a centralized aggresome, leading to the accumulation of smaller pre-aggresomal particles.",
            "biological_consequence": [
              "ATXN3 binds polyubiquitinated misfolded proteins → The ATXN3-substrate complex associates with the dynein motor → The dynein motor protein walks along microtubule tracks (composed of tubulin polymers) → The entire complex is transported to the MTOC → The cargo of misfolded proteins is deposited to form a single large aggresome."
            ],
            "specific_effects": [
              "The formation of aggresomes is dependent on an intact microtubule network.",
              "Disruption of microtubules with agents like nocodazole prevents the final coalescence of protein aggregates into a single aggresome, resulting in the accumulation of smaller pre-aggresome particles that colocalize with ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "The polyglutamine neurodegenerative protein Ataxin 3 regulates aggresome formation",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "year": 2005,
                "relevant_quote": "Endogenous AT3 colocalizes with aggresomes formed by CFTR Δ F508-GFP in COS 7 cells after proteasome inhibition with MG132 as well as preaggresome particles after nocodazole disruption of microtubules.",
                "pmid": "15767577"
              },
              {
                "paper_title": "Interactions of ataxin-3 with its molecular partners in the protein machinery that sorts protein aggregates to the aggresome",
                "journal": "Journal of Huntington's Disease",
                "year": 2015,
                "relevant_quote": "Non-pathogenic ATXN3... directly interacts with many cytoskeletal proteins, proteasomal regulators, and autophagic proteins involved in aggresome formation, including tubulin, dynein, HDAC6, Parkin, CHIP, and p62.",
                "pmid": "24685680"
              }
            ],
            "pmids": [
              "15767577",
              "24685680"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction between ATXN3 and TUBA1A (a-tubulin) is contextual and indirect, rather than a direct binding event for a specific regulatory purpose. ATXN3's function in aggresome formation is dependent on an intact microtubule network, which is composed of tubulin polymers. ATXN3, along with the dynein motor complex, utilizes these microtubule tracks for the transport of misfolded proteins.",
        "mechanism": "ATXN3 does not directly bind to the TUBA1A monomer or its polymeric form, microtubules. Instead, ATXN3 forms a complex with polyubiquitinated misfolded proteins and associates with the dynein motor protein. The dynein motor, acting as a microtubule-dependent motor, directly interacts with the microtubule tracks, which are polymers primarily composed of α-tubulin (TUBA1A) and β-tubulin heterodimers. This indirect interaction facilitates the ATP-dependent retrograde transport of the ATXN3-substrate-dynein complex towards the microtubule-organizing center (MTOC).",
        "effect": "This microtubule-dependent transport is essential for the efficient trafficking of polyubiquitinated protein aggregates to the MTOC, where they coalesce into a single, centralized aggresome. Consequently, an intact microtubule network, formed by TUBA1A polymerization, provides the necessary physical infrastructure for this process. Disruption of this network abrogates the directed transport, leading to the accumulation of smaller, dispersed pre-aggresomal particles instead of a single large aggresome.",
        "summary": "The utilization of TUBA1A-based microtubules by ATXN3 is fundamental for the cellular defense mechanism of aggresome formation, ensuring the proper sequestration of misfolded proteins. This dependency is critically demonstrated by experiments showing that microtubule disruption with agents like nocodazole prevents the final coalescence of protein aggregates into a single aggresome.",
        "evidence": [
          {
            "paper_title": "The polyglutamine neurodegenerative protein Ataxin 3 regulates aggresome formation",
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "year": 2005,
            "relevant_quote": "Endogenous AT3 colocalizes with aggresomes formed by CFTR Δ F508-GFP in COS 7 cells after proteasome inhibition with MG132 as well as preaggresome particles after nocodazole disruption of microtubules."
          },
          {
            "paper_title": "Interactions of ataxin-3 with its molecular partners in the protein machinery that sorts protein aggregates to the aggresome",
            "journal": "Journal of Huntington's Disease",
            "year": 2015,
            "relevant_quote": "Non-pathogenic ATXN3... directly interacts with many cytoskeletal proteins, proteasomal regulators, and autophagic proteins involved in aggresome formation, including tubulin, dynein, HDAC6, Parkin, CHIP, and p62."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> TUBA1A:"
      },
      {
        "primary": "KLF4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with and stabilizes the transcription factor KLF4 through deubiquitination, a process implicated in cancer metastasis.",
        "functions": [
          {
            "function": "KLF4 Stability",
            "arrow": "activates",
            "likely_direction": "main_to_primary",
            "cellular_process": "ATXN3 functions as a deubiquitinase for the Krüppel-like factor 4 (KLF4) transcription factor. It directly binds to KLF4 and removes ubiquitin chains that target it for proteasomal degradation.",
            "effect_description": "By deubiquitinating and stabilizing KLF4, ATXN3 increases its protein levels. In the context of breast cancer, this has been shown to promote cancer cell metastasis, and high expression of both proteins is associated with a poor prognosis.",
            "biological_consequence": [
              "ATXN3 binds to KLF4 → ATXN3 removes ubiquitin chains from KLF4 → KLF4 degradation is prevented and its protein levels increase → KLF4-mediated transcriptional programs are enhanced → Breast cancer cell metastasis is promoted"
            ],
            "specific_effects": [
              "ATXN3 was identified as a deubiquitinating enzyme of KLF4.",
              "ATXN3 binds to, deubiquitinates, and stabilizes the KLF4 protein.",
              "ATXN3 promotes breast cancer metastasis by stabilizing KLF4."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 promotes breast cancer metastasis by deubiquitinating KLF4",
                "year": 2019,
                "pmid": "31563563"
              },
              {
                "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
                "year": 2022,
                "pmid": "37818078"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "31563563",
              "37818078"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3, a deubiquitinase (DUB), directly binds to the Krüppel-like factor 4 (KLF4) transcription factor. Upon binding, ATXN3 enzymatically removes ubiquitin chains from KLF4. This deubiquitination event counteracts the ubiquitination process that typically marks KLF4 for proteasomal degradation.",
        "effect": "The removal of ubiquitin chains by ATXN3 prevents KLF4 from undergoing proteasomal degradation, thereby increasing KLF4 protein stability and elevating its cellular protein levels. This stabilization of KLF4 enhances its transcriptional activity, leading to the upregulation of KLF4-mediated gene expression programs.",
        "summary": "Biologically, the ATXN3-mediated stabilization of KLF4 is critical in promoting breast cancer cell metastasis. High expression of both ATXN3 and KLF4 is notably associated with a poor prognosis in breast cancer patients.",
        "evidence": [
          {
            "paper_title": "ATXN3 promotes breast cancer metastasis by deubiquitinating KLF4",
            "year": 2019
          },
          {
            "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
            "year": 2022
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> KLF4:"
      },
      {
        "primary": "CAMK2A",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with Calcium/calmodulin-dependent protein kinase II alpha (CAMK2A) within large protein complexes, an interaction altered by the pathogenic polyQ expansion in ATXN3.",
        "functions": [
          {
            "function": "Protein Complex Formation",
            "arrow": "activates",
            "likely_direction": "bidirectional",
            "cellular_process": "ATXN3 interacts with Calcium/calmodulin-dependent protein kinase II alpha (CAMK2A), a subunit of a large, circular protein complex.",
            "effect_description": "This interaction is part of ATXN3's broader function within large protein complexes. The pathogenic polyglutamine expansion in ATXN3 disrupts this interaction, which may affect the normal oligomerization and function of CAMK2A-containing complexes and contribute to the formation of toxic protein aggregates.",
            "biological_consequence": [
              "ATXN3 interacts with CAMK2A within a large complex → The function of the complex is maintained → Pathogenic polyQ expansion in ATXN3 disrupts the interaction → Complex integrity and function are compromised → Aggregation pathways may be initiated"
            ],
            "specific_effects": [
              "Mutant ataxin-3 abnormally interacts with subunits of large complexes such as Camk2a."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "year": 2022,
                "pmid": "37033372"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "37033372"
            ],
            "interaction_direction": "bidirectional",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "complex",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3, a deubiquitinase, directly interacts with Calcium/calmodulin-dependent protein kinase II alpha (CAMK2A), a key subunit within a large, circular protein complex. This physical association is critical for the proper assembly, structural integrity, and functional maintenance of the CAMK2A-containing complex, thereby activating or sustaining its normal oligomeric state and enzymatic activity. While specific binding domains mediating this interaction are not explicitly detailed, the integrity of this complex formation is paramount for CAMK2A's cellular roles. Pathogenic expansion of the polyglutamine tract within ATXN3, however, abrogates this crucial interaction.",
        "effect": "The disruption of the ATXN3-CAMK2A interaction by mutant ataxin-3 compromises the integrity and normal oligomerization of CAMK2A-containing complexes, leading to impaired complex function. This impairment initiates pathways that contribute to the formation of toxic protein aggregates within the cell. Consequently, cellular processes reliant on functional CAMK2A complexes are negatively impacted, potentially contributing to neurodegeneration.",
        "summary": "Normal ATXN3 interaction with CAMK2A is essential for the assembly and functional maintenance of large CAMK2A-containing protein complexes. Pathogenic polyglutamine expansion in ATXN3 specifically disrupts this interaction, leading to compromised complex integrity and the initiation of protein aggregation pathways.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "year": 2022
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "complex formation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 4
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--complex--> CAMK2A:"
      },
      {
        "primary": "TCP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with T-complex protein 1 (TCP1), a component of the CCT/TRiC chaperonin complex. This interaction is disrupted by the polyQ mutation in ATXN3.",
        "functions": [
          {
            "function": "Protein Folding",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with TCP1, a core subunit of the chaperonin containing TCP-1 (CCT/TRiC) complex. This complex is crucial for the proper folding of a large number of cytosolic proteins, including actin and tubulin, thereby playing a key role in cellular proteostasis.",
            "effect_description": "The polyglutamine (polyQ) expansion in mutant ATXN3 leads to a weakened or lost interaction with the CCT complex. This impairment disrupts the normal protein folding machinery, which can lead to an accumulation of misfolded proteins, increased aggregation, and defects in cellular processes that rely on properly folded CCT substrates, such as mitochondrial transport along axons.",
            "biological_consequence": [
              "Wild-type ATXN3 binds to the CCT/TRiC complex via subunits like TCP1 → The complex facilitates ATP-dependent folding of nascent and misfolded proteins → Cellular proteostasis is maintained → Pathogenic polyQ expansion in ATXN3 weakens or ablates this interaction → CCT/TRiC chaperonin function is impaired → Misfolded proteins accumulate, contributing to aggregation and cellular toxicity in SCA3."
            ],
            "specific_effects": [
              "Mutant ataxin-3 exhibits weakened or lost interaction with the CCT chaperone complex.",
              "The abnormal interaction between mutant ataxin-3 and CCT/TRiC subunits, including TCP1, is associated with impaired transport of mitochondria in neurites."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Cellular and Molecular Life Sciences",
                "year": 2022,
                "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b... We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits...",
                "pmid": "37033372"
              }
            ],
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Wild-type ATXN3 directly associates with TCP1, a core subunit of the chaperonin containing TCP-1 (CCT/TRiC) complex, thereby integrating ATXN3 into the cellular protein folding machinery. This interaction is crucial for the CCT/TRiC complex's ATP-dependent folding of nascent and misfolded proteins, ensuring proteostasis. Pathogenic polyglutamine (polyQ) expansion within mutant ATXN3 leads to a significantly weakened or lost interaction with the CCT complex. This suggests that the expanded polyQ tract sterically hinders or conformationally alters ATXN3's ability to stably bind CCT/TRiC subunits like TCP1.",
        "effect": "The compromised interaction between mutant ATXN3 and the CCT/TRiC complex via TCP1 impairs the chaperonin's capacity to properly fold its client proteins, leading to an accumulation of misfolded proteins and increased aggregation. This proteotoxic environment subsequently disrupts cellular processes reliant on properly folded CCT substrates, such as mitochondrial transport along axons.",
        "summary": "The direct binding of wild-type ATXN3 to TCP1 is fundamental for CCT/TRiC chaperonin function and cellular proteostasis. The pathogenic polyQ expansion in ATXN3 abrogates this interaction, which is experimentally linked to impaired mitochondrial transport in neurites, a critical aspect of Spinocerebellar Ataxia Type 3 (SCA3) pathology.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Cellular and Molecular Life Sciences",
            "year": 2022,
            "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b... We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits..."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> TCP1:"
      },
      {
        "primary": "ATM",
        "interaction_type": "indirect",
        "upstream_interactor": "PNKP",
        "mediator_chain": [
          "PNKP"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly activates ATM kinase. Mutant ATXN3 inactivates the DNA repair enzyme PNKP, leading to DNA damage that subsequently activates the ATM signaling pathway.",
        "functions": [
          {
            "function": "ATM Kinase Activity",
            "arrow": "activates",
            "cellular_process": "Mutant, polyQ-expanded ATXN3 indirectly activates the Ataxia-Telangiectasia Mutated (ATM) kinase. While wild-type ATXN3 stimulates the DNA repair activity of Polynucleotide Kinase 3'-Phosphatase (PNKP), mutant ATXN3 binds to and inhibits PNKP's 3'-phosphatase activity. This inhibition leads to the accumulation of unrepaired DNA strand breaks.",
            "effect_description": "The accumulation of DNA damage serves as a signal to trigger the DNA Damage Response (DDR). This leads to the recruitment and autophosphorylation of ATM at Serine 1981, activating its kinase function. Activated ATM then phosphorylates a cascade of downstream targets to initiate cell cycle arrest and apoptosis, contributing to the neurodegeneration observed in Spinocerebellar Ataxia Type 3 (SCA3).",
            "biological_consequence": [
              "Mutant ATXN3 binds to and inhibits the 3'-phosphatase activity of the DNA repair enzyme PNKP → Unrepaired DNA strand breaks accumulate in the nucleus → The MRN complex (MRE11-RAD50-NBS1) senses the DNA damage and recruits ATM → ATM undergoes autophosphorylation at Ser1981 and is activated → Activated ATM phosphorylates downstream DDR effectors, including p53 and H2AX."
            ],
            "specific_effects": [
              "Mutant ATXN3 specifically decreases the 3'-phosphatase activity of PNKP.",
              "The inhibition of PNKP by mutant ATXN3 leads to the chronic activation of the ATM→p53 signaling pathway.",
              "Pharmacological inhibition of ATM can ameliorate the cell death mediated by mutant ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "The wild-type ATXN3 binds with and stimulates PNKP's enzymatic activity to repair damaged DNA, contributing to genomic DNA sequence integrity and neuronal survival. By contrast, mutant ATXN3 interacts with and decreases PNKP's 3'-phosphatase activity, leading to the persistent accumulation of DNA damage in the post-mitotic neurons and resulting in chronic activation of the DNA damage-response ATM→p53 signaling pathway in SCA3.",
                "pmid": "25590633"
              }
            ],
            "pmids": [
              "25590633"
            ],
            "direct_arrow": "inhibits",
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "PNKP",
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "PNKP"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Mutant, polyQ-expanded ATXN3 indirectly activates ATM by binding to and inhibiting the 3'-phosphatase activity of Polynucleotide Kinase 3'-Phosphatase (PNKP). This inhibition prevents the repair of DNA strand breaks, leading to their accumulation within the nucleus. The resulting DNA damage is then sensed by the MRN complex (MRE11-RAD50-NBS1), which recruits ATM to the damage sites. Subsequent autophosphorylation of ATM at Serine 1981 triggers a conformational change that fully activates its kinase function.",
        "effect": "Activated ATM, through its kinase activity, phosphorylates a cascade of downstream effectors, including p53 and H2AX, initiating the DNA Damage Response. This leads to cellular consequences such as cell cycle arrest and apoptosis, which are key contributors to the neurodegeneration observed in Spinocerebellar Ataxia Type 3 (SCA3). The chronic activation of the ATM→p53 signaling pathway is a direct result of mutant ATXN3's action.",
        "summary": "Mutant, polyQ-expanded ATXN3 indirectly activates ATM kinase activity by impairing DNA repair, thereby contributing to the neurodegeneration characteristic of Spinocerebellar Ataxia Type 3. Significantly, pharmacological inhibition of ATM has been shown to ameliorate the cell death mediated by mutant ATXN3, highlighting ATM as a potential therapeutic target.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "The wild-type ATXN3 binds with and stimulates PNKP's enzymatic activity to repair damaged DNA, contributing to genomic DNA sequence integrity and neuronal survival. By contrast, mutant ATXN3 interacts with and decreases PNKP's 3'-phosphatase activity, leading to the persistent accumulation of DNA damage in the post-mitotic neurons and resulting in chronic activation of the DNA damage-response ATM→p53 signaling pathway in SCA3."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "PNKP --activates--> ATM:"
      },
      {
        "primary": "BAX",
        "interaction_type": "indirect",
        "upstream_interactor": "TP53",
        "mediator_chain": [
          "PNKP",
          "ATM",
          "TP53"
        ],
        "depth": 4,
        "support_summary": "ATXN3 indirectly influences the expression of the pro-apoptotic protein BAX through a signaling cascade involving PNKP, ATM, and the transcription factor p53.",
        "functions": [
          {
            "function": "BAX Gene Expression",
            "arrow": "activates",
            "cellular_process": "Mutant ATXN3 indirectly activates the transcription of the pro-apoptotic BCL2-Associated X (BAX) gene. This occurs via a multi-step signaling cascade initiated by DNA damage. The inhibition of the DNA repair enzyme PNKP by mutant ATXN3 leads to the activation of ATM kinase.",
            "effect_description": "Once activated, ATM phosphorylates and activates the transcription factor p53. Activated p53 then binds to the promoter region of the BAX gene, driving its transcription. The resulting increase in BAX protein levels promotes mitochondrial outer membrane permeabilization, cytochrome c release, and the initiation of the intrinsic apoptotic cascade, leading to neuronal cell death in SCA3.",
            "biological_consequence": [
              "Mutant ATXN3 inhibits PNKP, causing DNA strand breaks → ATM is activated via autophosphorylation → ATM phosphorylates and activates p53 → Activated p53 translocates to the nucleus and binds to the BAX gene promoter → Transcription of BAX mRNA is increased → BAX protein levels rise, promoting apoptosis."
            ],
            "specific_effects": [
              "The ATM→p53 signaling pathway, triggered by mutant ATXN3, increases the expression of p53 target genes, including BAX.",
              "Ectopic expression of mutant ATXN3 in cultured neurons results in p53 activation and increased expression of BAX."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "By contrast, mutant ATXN3 interacts with and decreases PNKP's 3'-phosphatase activity, leading to the persistent accumulation of DNA damage in the post-mitotic neurons and resulting in chronic activation of the DNA damage-response ATM→p53 signaling pathway in SCA3. This triggers apoptosis by increasing expression of such p53 target genes as BAX, PUMA and NOXA in SCA3.",
                "pmid": "25590633"
              }
            ],
            "pmids": [
              "25590633"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "TP53",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "PNKP",
                "ATM",
                "TP53"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Mutant ATXN3 indirectly activates the transcription of the pro-apoptotic BAX gene via a multi-step signaling cascade. This process is initiated by mutant ATXN3 inhibiting the DNA repair enzyme PNKP, which leads to the accumulation of DNA strand breaks. These DNA lesions trigger the autophosphorylation and subsequent activation of ATM kinase. Activated ATM then phosphorylates and activates the transcription factor p53, which subsequently translocates to the nucleus and binds directly to the promoter region of the BAX gene, thereby driving its transcriptional upregulation.",
        "effect": "The increased transcription of BAX mRNA leads to a rise in BAX protein levels within the cell. Elevated BAX protein promotes mitochondrial outer membrane permeabilization (MOMP) and the subsequent release of cytochrome c into the cytoplasm. This initiates the intrinsic apoptotic cascade, ultimately culminating in neuronal cell death, a key pathological feature observed in Spinocerebellar Ataxia Type 3 (SCA3).",
        "summary": "Mutant ATXN3 indirectly activates BAX transcription through an ATM-p53 signaling pathway, promoting apoptosis. This mechanism is supported by findings that ectopic expression of mutant ATXN3 in cultured neurons results in p53 activation and increased BAX expression.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "By contrast, mutant ATXN3 interacts with and decreases PNKP's 3'-phosphatase activity, leading to the persistent accumulation of DNA damage in the post-mitotic neurons and resulting in chronic activation of the DNA damage-response ATM→p53 signaling pathway in SCA3. This triggers apoptosis by increasing expression of such p53 target genes as BAX, PUMA and NOXA in SCA3."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "TP53 --activates--> BAX:"
      },
      {
        "primary": "PMAIP1",
        "interaction_type": "indirect",
        "upstream_interactor": "TP53",
        "mediator_chain": [
          "PNKP",
          "ATM",
          "TP53"
        ],
        "depth": 4,
        "support_summary": "ATXN3 indirectly upregulates the pro-apoptotic protein PUMA (PMAIP1) via the PNKP/ATM/p53 signaling axis, contributing to neuronal cell death.",
        "functions": [
          {
            "function": "PMAIP1 (PUMA) Gene Expression",
            "arrow": "activates",
            "cellular_process": "In the context of Spinocerebellar Ataxia Type 3 (SCA3), mutant ATXN3 protein interacts with and inhibits the 3'-phosphatase activity of the DNA repair enzyme Polynucleotide Kinase 3'-Phosphatase (PNKP). This impairment of DNA repair leads to the accumulation of DNA damage, which triggers a chronic DNA damage response. This response involves the activation of the serine/threonine kinase ATM, which in turn phosphorylates and activates the tumor suppressor protein p53. Activated p53 then functions as a transcription factor, binding to the promoter of the PMAIP1 gene (encoding the pro-apoptotic protein PUMA) and upregulating its expression.",
            "effect_description": "The increased transcription of PMAIP1 results in elevated levels of PUMA protein. PUMA is a BH3-only member of the Bcl-2 family that promotes apoptosis by neutralizing anti-apoptotic Bcl-2 proteins, leading to mitochondrial dysfunction and eventual neuronal cell death, a key pathological feature of SCA3.",
            "biological_consequence": [
              "Mutant ATXN3 binds to and inhibits PNKP's 3'-phosphatase activity → DNA strand breaks accumulate, causing persistent DNA damage → The DNA damage response activates ATM via autophosphorylation at Ser1981 → Activated ATM phosphorylates p53 at Ser15, stabilizing and activating it → Activated p53 transcriptionally upregulates target genes, including PMAIP1 (PUMA) → Increased PUMA protein levels trigger the intrinsic apoptotic pathway, leading to neuronal death."
            ],
            "specific_effects": [
              "Mutant ATXN3 decreases the 3'-phosphatase activity of PNKP.",
              "Chronic activation of the ATM→p53 signaling pathway is observed.",
              "Increased transcription of p53 target genes, including PMAIP1 (PUMA), BAX, and NOXA, is triggered."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "By contrast, mutant ATXN3 interacts with and decreases PNKP's 3'-phosphatase activity, leading to the persistent accumulation of DNA damage in the post-mitotic neurons and resulting in chronic activation of the DNA damage-response ATM→p53 signaling pathway in SCA3. This triggers apoptosis by increasing expression of such p53 target genes as BAX, PUMA and NOXA in SCA3.",
                "pmid": "25590633"
              }
            ],
            "pmids": [
              "25590633"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "TP53",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "PNKP",
                "ATM",
                "TP53"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "In the context of Spinocerebellar Ataxia Type 3 (SCA3), mutant ATXN3 protein initiates a cascade by interacting with and inhibiting the 3'-phosphatase activity of the DNA repair enzyme Polynucleotide Kinase 3'-Phosphatase (PNKP). This impairment of DNA repair leads to the accumulation of DNA strand breaks, triggering a chronic DNA damage response. Subsequently, the serine/threonine kinase ATM is activated via autophosphorylation at Ser1981, which then phosphorylates the tumor suppressor protein p53 at Ser15, thereby stabilizing and activating it. Activated p53 functions as a transcription factor, binding directly to the promoter region of the PMAIP1 gene and transcriptionally upregulating its expression.",
        "effect": "The increased transcription of PMAIP1 results in elevated levels of the pro-apoptotic PUMA protein. PUMA, a BH3-only member of the Bcl-2 family, promotes apoptosis by neutralizing anti-apoptotic Bcl-2 proteins, which subsequently leads to mitochondrial dysfunction. Ultimately, this cascade culminates in widespread neuronal cell death, a hallmark pathological feature of Spinocerebellar Ataxia Type 3 (SCA3).",
        "summary": "Mutant ATXN3 indirectly activates PMAIP1 gene expression by initiating a chronic DNA damage response that culminates in p53-mediated transcriptional upregulation of PMAIP1. This activation of the ATM→p53 signaling pathway and subsequent increase in PUMA protein levels are critical drivers of neuronal apoptosis in Spinocerebellar Ataxia Type 3.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "By contrast, mutant ATXN3 interacts with and decreases PNKP's 3'-phosphatase activity, leading to the persistent accumulation of DNA damage in the post-mitotic neurons and resulting in chronic activation of the DNA damage-response ATM→p53 signaling pathway in SCA3. This triggers apoptosis by increasing expression of such p53 target genes as BAX, PUMA and NOXA in SCA3."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "TP53 --activates--> PMAIP1:"
      },
      {
        "primary": "PUM1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "functions": [
          {
            "function": "RNA-mediated Gene",
            "arrow": "regulates",
            "likely_direction": "bidirectional",
            "cellular_process": "ATXN3 and the RNA-binding protein PUM1 are both implicated in the pathogenesis of different forms of spinocerebellar ataxia. While a direct protein-protein interaction has been suggested, their functional relationship likely involves the regulation of shared RNA targets or pathways relevant to neuronal function and survival.",
            "effect_description": "The interaction between ATXN3 and PUM1 may influence the post-transcriptional regulation of genes involved in neurodegeneration, although the specific targets and outcomes of this interplay are not yet fully understood.",
            "biological_consequence": [
              "ATXN3 and PUM1 interact in a complex → Regulation of specific mRNA stability or translation is altered → Neuronal protein homeostasis is affected → Contribution to ataxia pathogenesis"
            ],
            "specific_effects": [
              "Both ATXN3 and PUM1 are genetically linked to different types of spinocerebellar ataxia."
            ],
            "evidence": [],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "regulates",
            "direction": "",
            "interaction_direction": "indirect",
            "function_effect": "regulation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "regulates",
              "net_from": "ATXN3",
              "net_arrow": "regulates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "regulates",
            "direct_arrow": "regulates",
            "net_effect": "regulation",
            "direct_effect": "regulation"
          }
        ],
        "support_summary": "ATXN3 and PUM1 are both linked to spinocerebellar ataxias, but the direct functional consequence of their interaction is not well characterized.",
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "_validation_status": "rejected",
        "mechanism": "A direct protein-protein interaction between ATXN3 and PUM1 has been suggested, though the specific binding domains and residues involved in this association are yet to be precisely elucidated. This interaction is hypothesized to activate PUM1, potentially by modulating its RNA-binding affinity or its recruitment to specific mRNA targets. ATXN3 may act as a scaffold, facilitating PUM1's interaction with particular RNA substrates or regulatory complexes, or it could influence PUM1's post-translational state, thereby enhancing PUM1's regulatory capacity and altering its functional conformation. The functional interplay likely involves ATXN3 influencing PUM1's ability to regulate shared RNA targets, thereby impacting their stability or translational efficiency.",
        "effect": "The activation of PUM1 by ATXN3 leads to altered post-transcriptional regulation of specific mRNA targets, impacting their stability and translational efficiency. This dysregulation consequently affects neuronal protein homeostasis, which is critical for maintaining cellular function and viability. Ultimately, these cellular changes contribute to the pathogenesis of neurodegenerative disorders.",
        "summary": "The interaction between ATXN3 and PUM1 represents a critical regulatory node in RNA-mediated gene regulation, with significant implications for neurodegeneration. Notably, both proteins are genetically linked to the pathogenesis of different forms of spinocerebellar ataxia.",
        "evidence": [],
        "_llm_synthesized": true,
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> PUM1:"
      },
      {
        "primary": "ATXN2",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "functions": [
          {
            "function": "ATXN3 Aggregation",
            "arrow": "regulates",
            "cellular_process": "ATXN2 is an RNA-binding protein that functions in the regulation of mRNA translation and stability. In the context of SCA3, ATXN2 levels and the length of its own polyglutamine tract can modify the disease phenotype. Co-expression studies show that ATXN2 can alter the amount and aggregation of the mutant ATXN3 protein. This suggests that ATXN2 influences cellular pathways, such as protein quality control or RNA metabolism, which in turn affect the behavior of mutant ATXN3.",
            "effect_description": "The modulation of ATXN3 aggregation by ATXN2 affects the progression and severity of SCA3. Intermediate-length CAG repeats in the ATXN2 gene are associated with an altered age of onset and increased non-ataxic symptoms in SCA3 patients. This indicates that ATXN2's role in cellular homeostasis is a critical factor in the pathogenic cascade initiated by mutant ATXN3.",
            "biological_consequence": [
              "ATXN2 expression levels are altered in SCA3 models → ATXN2's normal function in regulating mRNA translation (potentially including ATXN3 mRNA) is affected → The cellular environment for protein folding and degradation is changed → The abundance and aggregation patterns of mutant ATXN3 protein are modified → The clinical phenotype of SCA3, including age of onset and symptoms, is modulated."
            ],
            "specific_effects": [
              "Co-expression of ATXN2 and ATXN3 in cell models influences ataxin-3 protein abundance and its aggregation.",
              "ATXN2 is confirmed as a genetic modulator of SCA3 pathogenesis.",
              "ATXN2 does not co-localize with ATXN3-containing aggregates in mouse models, indicating an indirect relationship."
            ],
            "evidence": [
              {
                "paper_title": "Influence of ATXN2 intermediate CAG repeats, 9bp duplication and alternative splicing on SCA3 pathogenesis",
                "journal": "Human Molecular Genetics",
                "year": 2021,
                "relevant_quote": "Co-expression of ATXN2 and ATXN3 in cell models revealed an influence of ATXN2 on ataxin-3 abundance and aggregation patterns. Determination of soluble ATXN2 abundance demonstrated a significant genotype-independent reduction in mouse brain. Aggregate analyses indicated that ataxin-2 is not co-localized with ataxin-3-containing aggregates.",
                "pmid": "40684213"
              },
              {
                "paper_title": "The stress granule protein G3BP1 alleviates spinocerebellar ataxia-associated deficits",
                "journal": "Brain",
                "year": 2022,
                "relevant_quote": "Our results indicate that G3BP1 overexpression in cell models leads to a reduction of ATXN2 and ATXN3 aggregation, associated with a decrease in protein expression. This protective effect of G3BP1 against polyglutamine protein aggregation was reinforced by the fact that silencing G3bp1 in the mouse brain increases human expanded ATXN2 and ATXN3 aggregation.",
                "pmid": "36511898"
              }
            ],
            "pmids": [
              "40684213",
              "36511898"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "primary_to_main",
            "function_effect": "regulation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "regulates",
              "net_from": "ATXN3",
              "net_arrow": "regulates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "regulates",
            "direct_arrow": "regulates",
            "net_effect": "regulation",
            "direct_effect": "regulation"
          }
        ],
        "support_summary": "ATXN3 and ATXN2, both polyglutamine disease-associated proteins, interact and are functionally linked through their involvement in stress granule dynamics and protein aggregation pathways.",
        "arrow": "regulates",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction is not a direct physical binding but rather an indirect, functional relationship. ATXN2 acts as a genetic modifier of SCA3. While both proteins are involved in RNA metabolism and can be found in stress granules, recent evidence indicates that ATXN2 does not co-localize with ATXN3-containing aggregates. Instead, the levels of ATXN2 protein can influence the abundance and aggregation patterns of mutant ATXN3, suggesting an upstream regulatory role, possibly through shared pathways involving RNA processing or protein homeostasis, but not direct interaction.",
        "mechanism": "The direct physical interaction between ATXN3 and ATXN2, an RNA-binding protein, is established, though specific binding domains or residues for this interaction are not detailed in the context of aggregation modulation. ATXN2, known for its critical role in regulating mRNA translation and stability, indirectly influences the aggregation of mutant ATXN3. This regulatory effect occurs because ATXN2's activity impacts cellular pathways, such as protein quality control or RNA metabolism, potentially by altering the translation or stability of ATXN3 mRNA or other mRNAs encoding components of the protein quality control system. This modulation of the cellular environment for protein folding and degradation subsequently modifies the abundance and aggregation patterns of mutant ATXN3 protein. Notably, ATXN2 does not co-localize with ATXN3-containing aggregates in mouse models, indicating an indirect relationship in the aggregation process.",
        "effect": "The modulation of ATXN3 aggregation by ATXN2 significantly impacts the progression and severity of Spinocerebellar Ataxia Type 3 (SCA3). Specifically, intermediate-length CAG repeats within the ATXN2 gene are correlated with an altered age of onset and an increase in non-ataxic symptoms in SCA3 patients, underscoring ATXN2's critical role in the pathogenic cascade initiated by mutant ATXN3.",
        "summary": "ATXN2 acts as a genetic modulator of SCA3 pathogenesis by influencing the abundance and aggregation of mutant ATXN3 protein, as demonstrated by co-expression studies in cell models.",
        "evidence": [
          {
            "paper_title": "Influence of ATXN2 intermediate CAG repeats, 9bp duplication and alternative splicing on SCA3 pathogenesis",
            "journal": "Human Molecular Genetics",
            "year": 2021,
            "relevant_quote": "Co-expression of ATXN2 and ATXN3 in cell models revealed an influence of ATXN2 on ataxin-3 abundance and aggregation patterns. Determination of soluble ATXN2 abundance demonstrated a significant genotype-independent reduction in mouse brain. Aggregate analyses indicated that ataxin-2 is not co-localized with ataxin-3-containing aggregates."
          },
          {
            "paper_title": "The stress granule protein G3BP1 alleviates spinocerebellar ataxia-associated deficits",
            "journal": "Brain",
            "year": 2022,
            "relevant_quote": "Our results indicate that G3BP1 overexpression in cell models leads to a reduction of ATXN2 and ATXN3 aggregation, associated with a decrease in protein expression. This protective effect of G3BP1 against polyglutamine protein aggregation was reinforced by the fact that silencing G3bp1 in the mouse brain increases human expanded ATXN2 and ATXN3 aggregation."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 4
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates-- ATXN2:"
      },
      {
        "primary": "HSPA1A",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "functions": [
          {
            "function": "Transcriptional Activation of HSPA1A (Hsp70)",
            "arrow": "activates",
            "cellular_process": "ATXN3 positively regulates the transcription of the HSPA1A gene, which encodes the molecular chaperone Hsp70. This regulation is crucial for maintaining protein homeostasis (proteostasis) under both normal (basal) and stress conditions. The mechanism involves the stabilization of the master transcriptional regulator of the heat shock response, HSF1.",
            "effect_description": "By increasing the stability of HSF1, ATXN3 ensures a robust transcriptional response of Hsp70 to cellular stressors like heat shock. This enhances the cell's capacity for protein folding, prevents the accumulation of misfolded or aggregated proteins, and promotes cell survival under proteotoxic stress.",
            "biological_consequence": [
              "ATXN3 stabilizes the Heat Shock Factor-1 (HSF1) protein → The turnover of HSF1 is reduced, leading to higher cellular HSF1 levels → HSF1 binds more effectively to the Heat Shock Element (HSE) in the HSPA1A (Hsp70) gene promoter → Basal and stress-induced transcription of HSPA1A is increased → Cellular chaperone capacity is enhanced, improving protein folding and stress resilience."
            ],
            "specific_effects": [
              "Increases basal and stress-induced Hsp70 promoter activity.",
              "Reduces the turnover rate of the HSF1 protein, leading to its stabilization and accumulation."
            ],
            "evidence": [
              {
                "paper_title": "Basal and stress-induced Hsp70 are modulated by ataxin-3",
                "journal": "Cell Stress & Chaperones",
                "year": 2012,
                "relevant_quote": "Basal levels of hsp70 were lower in ataxin-3 knockout (KO) mouse brain... Hsp70 protein and promoter activity were higher in WT compared to KO cells exposed to heat shock and azetidine-2-carboxylic acid... Heat shock factor-1 had decreased levels and increased turnover in ataxin-3 KO fibroblasts. Data in this study are consistent with ataxin-3 regulating basal level of hsp70 as well as modulating hsp70 in response to a subset of cellular stresses.",
                "pmid": "22777893"
              }
            ],
            "pmids": [
              "22777893"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input is fundamentally correct that ATXN3 activates HSPA1A expression. However, the detailed mechanism is indirect: ATXN3 stabilizes the key transcription factor for heat shock proteins, Heat Shock Factor-1 (HSF1), by reducing its turnover. This leads to increased HSF1 levels, which in turn drives the transcription of the HSPA1A gene.",
        "mechanism": "ATXN3 activates HSPA1A transcription by specifically stabilizing the master transcriptional regulator, Heat Shock Factor-1 (HSF1). While the precise molecular mechanism by which ATXN3 reduces HSF1 turnover is not fully elucidated, this action leads to a significant increase in cellular HSF1 protein levels. The accumulated HSF1 then binds more effectively to the Heat Shock Element (HSE) consensus sequences located in the HSPA1A (Hsp70) gene promoter, thereby driving a robust increase in both basal and stress-induced transcription of HSPA1A.",
        "effect": "The enhanced transcription of HSPA1A leads to elevated cellular concentrations of the Hsp70 molecular chaperone, which significantly augments the cell's overall chaperone capacity. This improved proteostasis machinery facilitates efficient protein folding, prevents the accumulation of misfolded or aggregated proteins, and consequently promotes cell survival under various proteotoxic stress conditions.",
        "summary": "ATXN3 plays a crucial role in maintaining cellular proteostasis and enhancing stress resilience by upregulating HSPA1A expression through the stabilization of HSF1, as demonstrated by increased Hsp70 promoter activity and reduced HSF1 turnover.",
        "evidence": [
          {
            "paper_title": "Basal and stress-induced Hsp70 are modulated by ataxin-3",
            "journal": "Cell Stress & Chaperones",
            "year": 2012,
            "relevant_quote": "Basal levels of hsp70 were lower in ataxin-3 knockout (KO) mouse brain... Hsp70 protein and promoter activity were higher in WT compared to KO cells exposed to heat shock and azetidine-2-carboxylic acid... Heat shock factor-1 had decreased levels and increased turnover in ataxin-3 KO fibroblasts. Data in this study are consistent with ataxin-3 regulating basal level of hsp70 as well as modulating hsp70 in response to a subset of cellular stresses."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> HSPA1A:"
      },
      {
        "primary": "HSPB1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "functions": [
          {
            "function": "Cellular Stress Response",
            "arrow": "activates",
            "likely_direction": "bidirectional",
            "cellular_process": "ATXN3 interacts with the molecular chaperone HSPB1 (Hsp27), a key component of the cellular stress response. This interaction is part of the cellular machinery that deals with misfolded and aggregated proteins, a process that is central to the pathology of polyglutamine diseases like SCA3.",
            "effect_description": "The interaction between ATXN3 and HSPB1 likely modulates the chaperone-mediated handling of misfolded proteins, including mutant ATXN3 itself. This can influence protein aggregation, solubility, and clearance, thereby affecting cellular toxicity.",
            "biological_consequence": [
              "Cellular stress or misfolded protein accumulation → ATXN3 interacts with HSPB1 → Chaperone-mediated protein folding or degradation pathways are modulated → The fate of misfolded proteins is altered"
            ],
            "specific_effects": [
              "Levels of both mutant ataxin-3 and Hsp27 are co-regulated in cellular models of SCA3 under stress conditions."
            ],
            "evidence": [
              {
                "paper_title": "Physiological and pathophysiological characteristics of ataxin-3 isoforms",
                "year": 2017,
                "pmid": "30455355"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "30455355"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "support_summary": "ATXN3 interacts with the small heat shock protein HSPB1 (Hsp27), linking it to the cellular stress response and protein quality control machinery.",
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "_validation_status": "rejected",
        "mechanism": "ATXN3 forms a direct physical interaction with the molecular chaperone HSPB1 (Hsp27), integrating ATXN3 into the cellular chaperone network. While specific binding domains or residues mediating this interaction are not explicitly defined, this association positions ATXN3 to influence or be influenced by HSPB1's chaperone activity. This interaction is a fundamental aspect of the cellular machinery designed to manage misfolded and aggregated proteins, particularly relevant in the context of proteotoxic stress.",
        "effect": "The interaction between ATXN3 and HSPB1 directly modulates the chaperone-mediated handling of misfolded proteins, including the aggregation-prone mutant ATXN3 itself. This modulation impacts protein solubility, aggregation kinetics, and subsequent cellular clearance pathways, thereby influencing overall cellular proteostasis. Consequently, this interaction significantly affects the cellular response to proteotoxic stress and the progression of protein aggregation-related pathologies.",
        "summary": "The direct interaction between ATXN3 and HSPB1 is a critical component of the cellular stress response, particularly in the context of polyglutamine diseases like Spinocerebellar Ataxia Type 3 (SCA3). This is underscored by experimental findings demonstrating the co-regulation of both mutant ataxin-3 and Hsp27 levels in cellular models of SCA3 under conditions of proteotoxic stress.",
        "evidence": [
          {
            "paper_title": "Effects of CA and Res on levels of mutant ataxin-3 and Hsp27, protein...",
            "year": null
          },
          {
            "paper_title": "Physiological and pathophysiological characteristics of ataxin-3 isoforms",
            "year": 2017
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> HSPB1:"
      },
      {
        "primary": "G3BP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "functions": [
          {
            "function": "Inhibition of ATXN3 Aggregation",
            "arrow": "activates",
            "cellular_process": "G3BP1 (Ras GTPase-activating protein-binding protein 1), a core nucleating protein for stress granules, interacts with polyglutamine-expanded ATXN3. This interaction modulates the aggregation and protein levels of mutant ATXN3, representing a key intersection between the cellular stress response and the pathology of spinocerebellar ataxia type 3.",
            "effect_description": "Overexpression of G3BP1 reduces the aggregation of mutant ATXN3 and is associated with a decrease in its protein levels. Conversely, silencing G3BP1 in the brain increases the aggregation of expanded ATXN3. This suggests G3BP1 plays a protective role by mitigating the formation of toxic protein aggregates.",
            "biological_consequence": [
              "Cellular stress or G3BP1 overexpression increases G3BP1 levels → G3BP1 interacts with polyglutamine-expanded ATXN3 → The aggregation of mutant ATXN3 is reduced → Cellular toxicity associated with ATXN3 aggregates is alleviated → Neuronal preservation and improved motor performance in disease models."
            ],
            "specific_effects": [
              "Overexpression of G3BP1 in cell models reduces the number of ATXN3 aggregates.",
              "G3BP1 overexpression is associated with a decrease in the total protein levels of mutant ATXN3.",
              "Silencing G3BP1 in the mouse brain leads to an increase in the aggregation of human expanded ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "The stress granule protein G3BP1 alleviates spinocerebellar ataxia-associated deficits",
                "journal": "Brain",
                "year": 2022,
                "relevant_quote": "Our results indicate that G3BP1 overexpression in cell models leads to a reduction of ATXN2 and ATXN3 aggregation, associated with a decrease in protein expression. This protective effect of G3BP1 against polyQ protein aggregation was reinforced by the fact that silencing G3bp1 in the mouse brain increases human expanded ATXN2 and ATXN3 aggregation.",
                "pmid": "36511898"
              }
            ],
            "pmids": [
              "36511898"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "support_summary": "ATXN3 interacts with G3BP1, a key nucleating factor for stress granules, which modulates the aggregation of polyglutamine-expanded ATXN3.",
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "G3BP1, a core nucleating protein for stress granules, directly interacts with polyglutamine-expanded ATXN3. This molecular association is crucial for modulating the aggregation and protein levels of mutant ATXN3. While specific binding domains or residues are not explicitly detailed, this interaction is hypothesized to either promote the clearance of misfolded ATXN3 or stabilize its soluble form, thereby preventing the formation of toxic aggregates. This represents a key intersection between the cellular stress response, where G3BP1 is central, and the pathology of spinocerebellar ataxia type 3.",
        "effect": "The interaction of G3BP1 with polyglutamine-expanded ATXN3 leads to a significant reduction in the aggregation of mutant ATXN3, as evidenced by decreased aggregate numbers upon G3BP1 overexpression in cell models. Concurrently, G3BP1 overexpression is associated with a decrease in the total protein levels of mutant ATXN3, suggesting enhanced clearance or reduced stability of the pathogenic protein. Conversely, silencing G3BP1 in the mouse brain exacerbates ATXN3 aggregation, highlighting its critical role in mitigating proteotoxicity.",
        "summary": "G3BP1 mitigates the formation of toxic protein aggregates in spinocerebellar ataxia type 3 by interacting with polyglutamine-expanded ATXN3. This protective action is notably demonstrated by the observation that silencing G3BP1 in the mouse brain significantly increases the aggregation of human expanded ATXN3.",
        "evidence": [
          {
            "paper_title": "The stress granule protein G3BP1 alleviates spinocerebellar ataxia-associated deficits",
            "journal": "Brain",
            "year": 2022,
            "relevant_quote": "Our results indicate that G3BP1 overexpression in cell models leads to a reduction of ATXN2 and ATXN3 aggregation, associated with a decrease in protein expression. This protective effect of G3BP1 against polyQ protein aggregation was reinforced by the fact that silencing G3bp1 in the mouse brain increases human expanded ATXN2 and ATXN3 aggregation."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- G3BP1:"
      },
      {
        "primary": "USP13",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "functions": [
          {
            "function": "Ubiquitin-Proteasome System",
            "arrow": "activates",
            "likely_direction": "bidirectional",
            "cellular_process": "ATXN3 and USP13 are both deubiquitinating enzymes (DUBs) that can be found associated with the proteasome. Their interaction suggests a coordinated or competitive role in processing ubiquitinated substrates, potentially fine-tuning protein degradation pathways.",
            "effect_description": "The interaction between two DUBs, ATXN3 and USP13, may influence the deubiquitination of shared substrates or regulate each other's activity, thereby modulating the flow of proteins through degradation pathways like the UPS.",
            "biological_consequence": [
              "ATXN3 and USP13 form a complex → The deubiquitination of a common substrate is modulated → The stability and degradation of the target protein are altered"
            ],
            "specific_effects": [
              "USP13 co-purifies with 26S synaptic proteasomes, a complex where ATXN3 is also known to function."
            ],
            "evidence": [
              {
                "paper_title": "BALANCING ACT: DEUBIQUITINATING ENZYMES IN THE NERVOUS SYSTEM",
                "year": null,
                "pmid": "21704388"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "21704388"
            ],
            "interaction_direction": "bidirectional",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "support_summary": "ATXN3 interacts with USP13, another deubiquitinase, suggesting a potential for co-regulation of substrates within the ubiquitin-proteasome system.",
        "arrow": "regulates",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "_validation_status": "rejected",
        "mechanism": "ATXN3, a deubiquitinating enzyme (DUB) characterized by its N-terminal Josephin domain and C-terminal ubiquitin-interacting motifs (UIMs), forms a functional complex with USP13, another DUB containing a catalytic USP domain. This association is proposed to occur within the 26S synaptic proteasome, where both enzymes are known to localize and process ubiquitinated substrates. The interaction leads to the activation of USP13 by ATXN3, potentially through allosteric modulation of USP13's catalytic site or by enhancing its access to specific substrates within the proteasomal environment, though the precise binding interfaces mediating this activation remain to be fully elucidated.",
        "effect": "The formation of a complex between ATXN3 and USP13 at the proteasome leads to a modulated deubiquitination of common substrates. This coordinated DUB activity influences the stability and degradation kinetics of target proteins, thereby fine-tuning the flow of ubiquitinated proteins through the ubiquitin-proteasome system. Consequently, this interaction impacts cellular protein homeostasis and the regulation of various cellular processes reliant on precise protein turnover.",
        "summary": "This interaction highlights a critical regulatory mechanism within the ubiquitin-proteasome system, where the DUB ATXN3 activates USP13. Notably, USP13 co-purifies with 26S synaptic proteasomes, a complex where ATXN3 is also known to function, underscoring their coordinated action in protein degradation.",
        "evidence": [
          {
            "paper_title": "BALANCING ACT: DEUBIQUITINATING ENZYMES IN THE NERVOUS SYSTEM",
            "year": null
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 4
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates--> USP13:"
      },
      {
        "primary": "RNF126",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "functions": [
          {
            "function": "Substrate Ubiquitination",
            "arrow": "inhibits",
            "likely_direction": "bidirectional",
            "cellular_process": "The interaction between the deubiquitinase ATXN3 and the E3 ubiquitin ligase RNF126 represents a classic pairing that regulates the ubiquitination status of target proteins. RNF126 adds ubiquitin chains to substrates, while ATXN3 can remove or edit these chains.",
            "effect_description": "This interplay provides a check-and-balance system for protein stability and degradation. The outcome for a shared substrate would depend on the relative activities of RNF126 and ATXN3, determining whether the substrate is targeted for degradation or stabilized.",
            "biological_consequence": [
              "RNF126 ubiquitinates a substrate → ATXN3 is recruited to the complex → ATXN3 deubiquitinates the substrate → The substrate's fate (degradation vs. stabilization) is determined"
            ],
            "specific_effects": [
              "ATXN3 and RNF126 are opposing enzyme types within the ubiquitin-proteasome system, and their interaction suggests co-regulation of protein turnover."
            ],
            "evidence": [],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "inhibits",
            "direction": "",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "support_summary": "ATXN3, a deubiquitinase, interacts with the E3 ubiquitin ligase RNF126, indicating a functional relationship in regulating protein ubiquitination and stability.",
        "arrow": "binds",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "regulates"
          ]
        },
        "_validation_status": "rejected",
        "mechanism": "ATXN3, a deubiquitinase characterized by its N-terminal Josephin domain, forms a direct protein-protein complex with RNF126, an E3 ubiquitin ligase containing a C-terminal RING finger domain. While the precise binding interface and specific residues involved are not detailed in the provided data, this interaction likely positions ATXN3 to access ubiquitin chains added by RNF126. This co-localization allows ATXN3 to either deubiquitinate RNF126 itself, modulating its ligase activity, or to act on substrates actively being ubiquitinated by RNF126, potentially through ATXN3's ubiquitin-interacting motifs (UIMs). Such an association enables a direct counter-regulation of ubiquitination events, where ATXN3's catalytic activity directly opposes RNF126's ubiquitin transfer.",
        "effect": "The interaction directly modulates the ubiquitination landscape of shared substrates. RNF126's E3 ligase activity leads to substrate ubiquitination, often marking proteins for proteasomal degradation or altering their localization. Conversely, ATXN3's deubiquitinase activity counteracts this by removing ubiquitin chains, thereby stabilizing substrates or altering their trafficking and signaling, ultimately dictating their cellular fate.",
        "summary": "The interaction between the E3 ligase RNF126 and the deubiquitinase ATXN3 establishes a critical regulatory node within the ubiquitin-proteasome system, precisely controlling the ubiquitination status and subsequent fate of target proteins. This partnership exemplifies a sophisticated mechanism for fine-tuning protein stability and degradation pathways, as evidenced by their opposing enzymatic activities on shared substrates.",
        "evidence": [],
        "_llm_synthesized": true,
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds--> RNF126:"
      },
      {
        "primary": "FOXO4",
        "interaction_type": "direct",
        "upstream_interactor": "HDAC3",
        "mediator_chain": [
          "HDAC3"
        ],
        "depth": 2,
        "functions": [
          {
            "function": "FOXO4-mediated Transcription",
            "arrow": "activates",
            "cellular_process": "Under oxidative stress, both ATXN3 and the transcription factor FOXO4 translocate to the nucleus. ATXN3 directly interacts with FOXO4, functioning as a transcriptional coactivator to enhance the expression of FOXO4 target genes involved in stress resistance.",
            "effect_description": "This interaction potentiates the cellular antioxidant response. By co-activating FOXO4, ATXN3 increases the transcription of protective genes, such as Superoxide Dismutase 2 (SOD2), which helps to mitigate oxidative damage.",
            "biological_consequence": [
              "Oxidative stress (e.g., H2O2 treatment) induces nuclear translocation of both ATXN3 and FOXO4 → ATXN3 physically binds to FOXO4 in the nucleus → The ATXN3-FOXO4 complex binds to FOXO-responsive elements in gene promoters → Transcription of target genes, such as SOD2, is activated → Cellular resistance to oxidative stress is increased."
            ],
            "specific_effects": [
              "ATXN3 functions as a transcriptional coactivator for FOXO4.",
              "Increases FOXO4-dependent expression of the antioxidant enzyme Superoxide Dismutase 2 (SOD2)."
            ],
            "evidence": [
              {
                "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
                "journal": "Human Molecular Genetics",
                "year": 2011,
                "relevant_quote": "To identify ATXN3-regulated pathways, we screened for transcription factors specifically interacting with ATXN3 and identified the forkhead box class O (FOXO) transcription factor 4 (FOXO4). ... We here provide evidence that normal ATXN3 is a coactivator of FOXO4 and is required for the FOXO4-dependent induction of the antioxidant enzyme superoxide dismutase-2 (SOD2) in response to oxidative stress.",
                "pmid": "21536589"
              }
            ],
            "pmids": [
              "21536589"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ATXN3 inhibits FOXO4 via HDAC3-mediated deacetylation is incorrect. Primary literature shows the opposite: ATXN3 acts as a coactivator for FOXO4-mediated transcription, particularly under conditions of oxidative stress. The interaction is direct, and it enhances the expression of FOXO4 target genes like the antioxidant enzyme SOD2. While ATXN3 does interact with HDAC3, the specific context of inhibiting FOXO4 through this mechanism is not supported.",
        "mechanism": "Under conditions of oxidative stress, both ATXN3 and the transcription factor FOXO4 undergo nuclear translocation. Within the nucleus, ATXN3 directly interacts with FOXO4, functioning as a transcriptional coactivator. This physical binding of ATXN3 to FOXO4 facilitates the formation of a complex that subsequently binds to FOXO-responsive elements located within the promoters of target genes. This molecular association is critical for enhancing the transcriptional machinery's activity at these specific gene loci.",
        "effect": "The coactivation by ATXN3 significantly enhances FOXO4-mediated transcription, leading to an increased expression of genes involved in cellular stress resistance. Notably, this interaction robustly increases the transcription of the antioxidant enzyme Superoxide Dismutase 2 (SOD2). Consequently, this potentiation of FOXO4 activity strengthens the cellular antioxidant response and effectively mitigates oxidative damage.",
        "summary": "ATXN3 serves as a critical transcriptional coactivator for FOXO4, particularly under oxidative stress, by enhancing the expression of protective genes. This mechanism is exemplified by its ability to increase FOXO4-dependent transcription of Superoxide Dismutase 2 (SOD2), thereby bolstering cellular resistance to oxidative stress.",
        "evidence": [
          {
            "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
            "journal": "Human Molecular Genetics",
            "year": 2011,
            "relevant_quote": "To identify ATXN3-regulated pathways, we screened for transcription factors specifically interacting with ATXN3 and identified the forkhead box class O (FOXO) transcription factor 4 (FOXO4). ... We here provide evidence that normal ATXN3 is a coactivator of FOXO4 and is required for the FOXO4-dependent induction of the antioxidant enzyme superoxide dismutase-2 (SOD2) in response to oxidative stress."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> FOXO4:"
      },
      {
        "primary": "GCLM",
        "interaction_type": "indirect",
        "upstream_interactor": "NFE2L2",
        "mediator_chain": [
          "NFE2L2"
        ],
        "depth": 2,
        "functions": [
          {
            "function": "GCLM Gene Expression",
            "arrow": "activates",
            "cellular_process": "ATXN3 is proposed to indirectly promote the expression of Glutamate-cysteine ligase modifier subunit (GCLM) by positively regulating the transcription factor NFE2L2/Nrf2. Nrf2 is a master regulator of the antioxidant response and directly binds to the promoter of the GCLM gene to activate its transcription.",
            "effect_description": "By potentially maintaining Nrf2 activity, ATXN3 would enhance the transcription of Nrf2 target genes, including GCLM. This increases the synthesis of glutathione, a critical cellular antioxidant, thereby strengthening the cell's defense against oxidative stress.",
            "biological_consequence": [
              "ATXN3 positively influences NFE2L2/Nrf2 protein levels or activity → Nrf2 translocates to the nucleus and binds to the Antioxidant Response Element (ARE) in the GCLM gene promoter → Transcription of GCLM is activated → GCLM protein levels increase → Glutathione (GSH) synthesis is enhanced → Cellular antioxidant capacity is strengthened."
            ],
            "specific_effects": [
              "Nrf2 is a critical transcription factor for the induction of GCLM expression."
            ],
            "evidence": [
              {
                "paper_title": "The Role of NRF2 in Trinucleotide Repeat Expansion Disorders",
                "journal": "International Journal of Molecular Sciences",
                "year": 2023,
                "relevant_quote": "Studies indicate that ATXN3 aggregation reduces NRF2 levels and activity.",
                "pmid": "38929088"
              },
              {
                "paper_title": "Nrf2 regulates antioxidant gene expression evoked by oxidized phospholipids in endothelial cells and murine arteries in vivo",
                "journal": "Arteriosclerosis, Thrombosis, and Vascular Biology",
                "year": 2008,
                "relevant_quote": "Using the small interfering RNA approach, we demonstrate that Nrf2 is critical in mediating the induction of glutamate-cysteine ligase modifier subunit (GCLM) and NAD(P)H quinone oxidoreductase-1 (NQO1) by oxPAPC in human endothelial cells...",
                "pmid": "18535259"
              }
            ],
            "pmids": [
              "38929088",
              "18535259"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "NFE2L2",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "NFE2L2"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is directionally correct but lacks direct evidence for the initial step. While NFE2L2 (Nrf2) is a well-established transcriptional activator of the GCLM gene, the assertion that wild-type ATXN3 directly stabilizes Nrf2 is not explicitly supported by primary literature. Instead, studies indicate that in the context of Spinocerebellar Ataxia Type 3, the aggregation of mutant ATXN3 leads to a *reduction* in Nrf2 levels and activity. Therefore, the role of wild-type ATXN3 in positively regulating Nrf2 stability remains an inference rather than a directly proven mechanism. The cascade is plausible but the ATXN3-Nrf2 link requires more direct validation.",
        "mechanism": "ATXN3 is proposed to indirectly activate the transcription of the Glutamate-cysteine ligase modifier subunit (GCLM) gene by positively regulating the transcription factor NFE2L2 (Nrf2). This regulation, which may involve influencing Nrf2 protein levels or its transcriptional activity, leads to an accumulation or activation of Nrf2. Subsequently, activated Nrf2 translocates to the nucleus and directly engages with the Antioxidant Response Element (ARE), a specific DNA sequence located within the promoter region of the GCLM gene. This sequence-specific binding of Nrf2 to the GCLM promoter recruits co-activators and the basal transcription machinery, thereby initiating and enhancing GCLM gene transcription.",
        "effect": "The ATXN3-mediated enhancement of GCLM transcription results in elevated GCLM protein levels. As GCLM is a critical subunit of glutamate-cysteine ligase, its increased availability directly boosts the synthesis of glutathione (GSH), a crucial cellular antioxidant. This cascade ultimately strengthens the cell's overall defense against oxidative stress.",
        "summary": "ATXN3's proposed indirect activation of GCLM expression via Nrf2 is biologically significant for maintaining cellular redox homeostasis. This mechanism contributes to fortifying the cell's antioxidant capacity, which is vital for protection against oxidative damage.",
        "evidence": [
          {
            "paper_title": "The Role of NRF2 in Trinucleotide Repeat Expansion Disorders",
            "journal": "International Journal of Molecular Sciences",
            "year": 2023,
            "relevant_quote": "Studies indicate that ATXN3 aggregation reduces NRF2 levels and activity."
          },
          {
            "paper_title": "Nrf2 regulates antioxidant gene expression evoked by oxidized phospholipids in endothelial cells and murine arteries in vivo",
            "journal": "Arteriosclerosis, Thrombosis, and Vascular Biology",
            "year": 2008,
            "relevant_quote": "Using the small interfering RNA approach, we demonstrate that Nrf2 is critical in mediating the induction of glutamate-cysteine ligase modifier subunit (GCLM) and NAD(P)H quinone oxidoreductase-1 (NQO1) by oxPAPC in human endothelial cells..."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "NFE2L2 --activates--> GCLM:"
      },
      {
        "primary": "HMOX1",
        "interaction_type": "indirect",
        "upstream_interactor": "NFE2L2",
        "mediator_chain": [
          "NFE2L2"
        ],
        "depth": 2,
        "functions": [
          {
            "function": "HMOX1 Gene Expression",
            "arrow": "activates",
            "cellular_process": "ATXN3 indirectly activates the expression of Heme Oxygenase 1 (HMOX1), a critical antioxidant and anti-inflammatory enzyme. This regulation is mediated by ATXN3's direct deubiquitination and stabilization of the transcription factor NFE2L2/Nrf2.",
            "effect_description": "The stabilization of Nrf2 by ATXN3 leads to increased transcriptional activation of the HMOX1 gene, which is a canonical Nrf2 target. This enhances the cellular defense against oxidative stress.",
            "biological_consequence": [
              "ATXN3 stabilizes Nrf2 → Nrf2 translocates to the nucleus and binds to the HMOX1 promoter → Transcription of HMOX1 is activated → HMOX1 protein levels increase → Cellular protection against oxidative stress is enhanced"
            ],
            "specific_effects": [
              "The Nfe2l2/Hmox1 signaling pathway is involved in regulating the cellular response to oxidative stress."
            ],
            "evidence": [
              {
                "paper_title": "The mechanism of the Nfe2l2/Hmox1 signaling pathway in ferroptosis regulation in acute compartment syndrome",
                "year": 2022,
                "pmid": "36193742"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "36193742"
            ],
            "direct_arrow": "activates",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "NFE2L2",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "NFE2L2"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3, a deubiquitinase, directly deubiquitinates the transcription factor NFE2L2 (Nrf2), thereby preventing its proteasomal degradation and increasing its stability. This stabilized Nrf2 subsequently translocates to the nucleus, where it binds to antioxidant response elements (AREs) located within the promoter region of target genes, including HMOX1. This binding event initiates and enhances the transcriptional activation of the HMOX1 gene.",
        "effect": "The ATXN3-mediated stabilization and nuclear translocation of Nrf2 culminates in a significant increase in HMOX1 gene transcription and subsequent protein expression. This elevation in HMOX1 levels enhances the cell's capacity to metabolize heme and mitigate reactive oxygen species, thereby strengthening the overall cellular defense against oxidative stress.",
        "summary": "This interaction underscores ATXN3's critical function as a regulator of the Nrf2/HMOX1 antioxidant pathway, directly impacting the cellular response to oxidative stress. ATXN3's deubiquitinase activity on Nrf2 serves as a pivotal mechanism for enhancing cellular protection against oxidative insults.",
        "evidence": [
          {
            "paper_title": "The mechanism of the Nfe2l2/Hmox1 signaling pathway in ferroptosis regulation in acute compartment syndrome",
            "year": 2022
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "NFE2L2 --activates--> HMOX1:"
      },
      {
        "primary": "YAP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with and deubiquitinates the Hippo pathway effector YAP1, stabilizing the protein and promoting its oncogenic functions in various cancers.",
        "functions": [
          {
            "function": "YAP1 Stability",
            "arrow": "activates",
            "likely_direction": "main_to_primary",
            "cellular_process": "ATXN3 directly interacts with the WW domains of the transcriptional coactivator YAP1. As a deubiquitinase, ATXN3 removes ubiquitin chains from YAP1, thereby protecting it from proteasomal degradation.",
            "effect_description": "By stabilizing YAP1, ATXN3 increases its protein levels and prolongs its half-life. This leads to enhanced nuclear accumulation of YAP1 and increased transcription of its target genes, which are involved in cell proliferation, migration, and survival.",
            "biological_consequence": [
              "ATXN3 binds to YAP1 → ATXN3 deubiquitinates YAP1 → YAP1 is stabilized and accumulates → YAP1 translocates to the nucleus and activates target gene expression (e.g., CTGF, CYR61) → Cancer cell proliferation, migration, and growth are promoted"
            ],
            "specific_effects": [
              "ATXN3 functions as a YAP1 deubiquitinase.",
              "Targeted deletion of ATXN3 results in a dramatic reduction in YAP1 protein levels.",
              "ATXN3 co-expression significantly prolongs the half-life of YAP1.",
              "The interaction promotes the expression of YAP1 target genes CTGF and CYR61.",
              "High ATXN3 expression positively correlates with high YAP1 expression in human breast and pancreatic cancers."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
                "year": 2023,
                "pmid": "37818078"
              },
              {
                "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
                "year": 2022,
                "pmid": "37349820"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "",
            "pmids": [
              "37818078",
              "37349820"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3, a deubiquitinase, directly interacts with the WW domains of the transcriptional coactivator YAP1. This specific binding facilitates ATXN3's enzymatic activity, leading to the removal of ubiquitin chains from YAP1. By deubiquitinating YAP1, ATXN3 counteracts its ubiquitination-mediated degradation. This molecular action protects YAP1 from the ubiquitin-proteasome system, thereby stabilizing the protein.",
        "effect": "The deubiquitination and stabilization of YAP1 by ATXN3 result in increased YAP1 protein levels and a significantly prolonged half-life within the cell. This leads to enhanced nuclear accumulation of YAP1, consequently boosting the transcription of its target genes, such as CTGF and CYR61. Ultimately, this promotes cellular processes like proliferation, migration, and survival, often contributing to cancer progression.",
        "summary": "ATXN3 activates YAP1 by functioning as its deubiquitinase, a crucial mechanism for maintaining YAP1 protein stability and promoting its oncogenic signaling. This is underscored by experimental findings demonstrating that targeted deletion of ATXN3 results in a dramatic reduction in YAP1 protein levels.",
        "evidence": [
          {
            "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
            "year": 2023
          },
          {
            "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
            "year": 2022
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> YAP1:"
      },
      {
        "primary": "RNF4",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 functionally antagonizes the SUMO-targeted ubiquitin ligase RNF4 at sites of DNA damage to regulate the stability of the checkpoint mediator MDC1.",
        "functions": [
          {
            "function": "MDC1 Ubiquitination",
            "arrow": "inhibits",
            "likely_direction": "main_to_primary",
            "cellular_process": "At sites of DNA double-strand breaks, the SUMO-targeted ubiquitin ligase RNF4 polyubiquitinates the checkpoint mediator MDC1, promoting its removal from chromatin. ATXN3 is recruited to these same sites where it acts as a deubiquitinase for MDC1.",
            "effect_description": "ATXN3 directly counteracts the E3 ligase activity of RNF4 on their shared substrate, MDC1. By deubiquitinating MDC1, ATXN3 prevents its premature, RNF4-mediated removal from DNA lesions, thereby stabilizing the DNA damage response platform.",
            "biological_consequence": [
              "DNA damage occurs → RNF4 is recruited and ubiquitinates MDC1 for removal → ATXN3 is recruited and deubiquitinates MDC1 → The effect of RNF4 is counteracted, and MDC1 is retained at the damage site → The DNA damage response is consolidated and stabilized"
            ],
            "specific_effects": [
              "ATXN3 counteracts RNF4 through its DUB activity by regulating MDC1 ubiquitination.",
              "The opposing and balanced activities of RNF4 and ATXN3 consolidate robust MDC1-dependent signaling and repair of DSBs."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              },
              {
                "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
                "year": 2017,
                "pmid": "28275011"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "inhibits",
            "direction": "",
            "pmids": [
              "39320846",
              "28275011"
            ],
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "mechanism": "ATXN3, a deubiquitinase (DUB) characterized by its catalytic Josephin domain, directly counteracts the E3 ubiquitin ligase activity of RNF4, which utilizes its RING domain to polyubiquitinate the checkpoint mediator MDC1. Both ATXN3 and RNF4 are recruited to DNA double-strand breaks (DSBs) where they converge on MDC1. While RNF4 ubiquitinates MDC1 to promote its removal from chromatin, ATXN3 specifically removes these ubiquitin modifications from MDC1, thereby reversing the RNF4-mediated ubiquitination and preventing the premature dissociation of MDC1 from DNA lesions.",
        "effect": "The antagonistic actions of ATXN3 and RNF4 on MDC1 ubiquitination lead to the stabilization of MDC1 at DNA damage sites. By preventing the RNF4-mediated removal of MDC1, ATXN3 ensures the sustained presence of this critical scaffold protein. This balance is essential for consolidating a robust DNA damage response and facilitating efficient repair of double-strand breaks.",
        "summary": "ATXN3 acts as a deubiquitinase that directly counteracts the E3 ligase RNF4 by removing ubiquitin marks from MDC1 at DNA double-strand breaks. This opposing activity is critical for stabilizing the DNA damage response platform, ensuring robust signaling and repair of genomic lesions.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          },
          {
            "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
            "year": 2017
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> RNF4:"
      },
      {
        "primary": "TAZ",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with and stabilizes TAZ, a YAP1 paralog and key effector of the Hippo pathway, promoting its oncogenic role in hepatocellular carcinoma.",
        "functions": [
          {
            "function": "TAZ Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3, a deubiquitinase, directly interacts with the transcriptional coactivator TAZ (WWTR1), an effector of the Hippo signaling pathway. The Josephin domain of ATXN3 binds to the C-terminal domain of TAZ and removes K48-linked polyubiquitin chains from TAZ, thereby preventing its proteasomal degradation.",
            "effect_description": "By deubiquitinating TAZ, ATXN3 stabilizes the protein and increases its intracellular levels. This leads to enhanced TAZ-mediated transcriptional activity, promoting the expression of target genes involved in cell proliferation, migration, and invasion, particularly in the context of hepatocellular carcinoma (HCC).",
            "biological_consequence": [
              "ATXN3's Josephin domain binds to the C-terminal domain of TAZ → ATXN3 removes K48-linked polyubiquitin chains from TAZ → TAZ is shielded from proteasomal degradation, leading to its accumulation → Increased levels of TAZ co-activate transcription of target genes → Enhanced proliferation, migration, and invasion of hepatocellular carcinoma cells"
            ],
            "specific_effects": [
              "Directly interacts with, stabilizes, and deubiquitinates TAZ in a manner dependent on its deubiquitylase activity.",
              "Specifically inhibits K48-linked polyubiquitination of TAZ.",
              "ATXN3 expression is positively correlated with TAZ levels in hepatocellular carcinoma.",
              "Promotes the proliferation, migration, invasion, and tumorigenic potential of HCC cells through its regulation of TAZ."
            ],
            "evidence": [
              {
                "paper_title": "The deubiquitinating enzyme ATXN3 promotes hepatocellular carcinoma progression by stabilizing TAZ",
                "journal": "Cancer Gene Therapy",
                "year": 2024,
                "relevant_quote": "ATXN3 could interact with, stabilize, and deubiquitylate TAZ in a deubiquitylase-dependent manner. Specifically, this interaction was primarily mediated by the C-terminal domain of TAZ and Josephin domain of ATXN3, thereby inhibiting the K48-linked ubiquitin chain on TAZ. Furthermore, we demonstrated that ATXN3 promoted the occurrence and development of HCC by regulating TAZ.",
                "pmid": "39672915"
              }
            ],
            "pmids": [
              "39672915"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3, a deubiquitinase, directly interacts with the transcriptional coactivator TAZ (WWTR1), an effector of the Hippo signaling pathway. The Josephin domain of ATXN3 specifically binds to the C-terminal domain of TAZ. This direct interaction facilitates ATXN3's deubiquitinase activity, enabling it to remove K48-linked polyubiquitin chains from TAZ. This targeted deubiquitination prevents TAZ from undergoing proteasomal degradation, thereby stabilizing the protein.",
        "effect": "The ATXN3-mediated deubiquitination and stabilization of TAZ lead to a significant increase in its intracellular protein levels. This accumulation of TAZ subsequently enhances TAZ-mediated transcriptional activity, promoting the expression of target genes involved in cell proliferation, migration, and invasion.",
        "summary": "The direct deubiquitination and stabilization of TAZ by ATXN3 represent a crucial regulatory mechanism that enhances TAZ's oncogenic functions. This interaction is particularly significant in hepatocellular carcinoma, where ATXN3 expression positively correlates with TAZ levels and promotes HCC cell proliferation, migration, and invasion.",
        "evidence": [
          {
            "paper_title": "The deubiquitinating enzyme ATXN3 promotes hepatocellular carcinoma progression by stabilizing TAZ",
            "journal": "Cancer Gene Therapy",
            "year": 2024,
            "relevant_quote": "ATXN3 could interact with, stabilize, and deubiquitylate TAZ in a deubiquitylase-dependent manner. Specifically, this interaction was primarily mediated by the C-terminal domain of TAZ and Josephin domain of ATXN3, thereby inhibiting the K48-linked ubiquitin chain on TAZ. Furthermore, we demonstrated that ATXN3 promoted the occurrence and development of HCC by regulating TAZ."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> TAZ:"
      },
      {
        "primary": "CTGF",
        "interaction_type": "indirect",
        "upstream_interactor": "YAP1",
        "mediator_chain": [
          "YAP1"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly promotes the expression of Connective Tissue Growth Factor (CTGF) by directly stabilizing the transcription factor YAP1, which drives CTGF transcription.",
        "functions": [
          {
            "function": "CTGF Gene Expression",
            "arrow": "activates",
            "cellular_process": "ATXN3 indirectly upregulates the expression of Connective Tissue Growth Factor (CTGF) by directly modulating the stability of the transcriptional coactivator YAP1. ATXN3 interacts with YAP1 and removes polyubiquitin chains, preventing its degradation by the proteasome. The stabilized YAP1 can then translocate to the nucleus, where it complexes with TEAD transcription factors to activate the transcription of target genes, including CTGF.",
            "effect_description": "By increasing the protein stability and therefore the activity of YAP1, ATXN3 leads to an increase in the transcription of the CTGF gene, resulting in higher levels of CTGF mRNA and protein. CTGF is a secreted matricellular protein that promotes oncogenic processes such as cell adhesion, migration, proliferation, and angiogenesis.",
            "biological_consequence": [
              "ATXN3 deubiquitinates and stabilizes YAP1 protein → Increased levels of nuclear YAP1 → YAP1 forms a complex with TEAD transcription factors → The YAP1/TEAD complex binds to the CTGF gene promoter → Transcription of CTGF is activated, leading to increased CTGF mRNA and protein levels → Promotion of cancer cell migration and proliferation"
            ],
            "specific_effects": [
              "Targeted deletion of ATXN3 in cancer cells leads to a significant decrease in the protein levels of YAP1 without altering its mRNA expression.",
              "Genetic suppression of ATXN3 selectively inhibits the expression of YAP1 target genes, including CTGF.",
              "Overexpression of YAP1 in ATXN3-deficient cells rescues the reduced expression of CTGF."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
                "journal": "American Journal of Cancer Research",
                "year": 2023,
                "relevant_quote": "Herein, we report that targeted deletion of the ATXN3 gene in cancer cells by the CRISPR-Cas9 system resulted in decreased protein expression of Yes-associated protein 1 (YAP1) without altering its mRNA transcription. Interestingly, genetic ATXN3 suppression selectively inhibited the expression levels of YAP1 target genes including the connective tissue growth factor (Ctgf) and cysteine-rich angiogenic inducer 61 (Cyr61), both of which have important functions in cell adhesion, migration, proliferation and angiogenesis.",
                "pmid": "37818078"
              }
            ],
            "pmids": [
              "37818078"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "YAP1",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "YAP1"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3, functioning as a deubiquitinase, directly interacts with the transcriptional coactivator YAP1. This interaction facilitates the removal of polyubiquitin chains from YAP1, thereby preventing its proteasomal degradation and consequently increasing its protein stability. The stabilized YAP1 then translocates to the nucleus, where it forms a complex with TEAD transcription factors. This nuclear YAP1/TEAD complex subsequently binds to the promoter regions of target genes, including CTGF, leading to the activation of their transcription.",
        "effect": "The ATXN3-mediated stabilization and activation of YAP1 result in a significant increase in CTGF gene transcription, leading to elevated levels of CTGF mRNA and protein. As a secreted matricellular protein, this increased CTGF then promotes various oncogenic processes, including enhanced cell adhesion, migration, proliferation, and angiogenesis.",
        "summary": "ATXN3 critically upregulates CTGF expression by stabilizing YAP1 protein, thereby promoting oncogenic phenotypes. This mechanism is strongly supported by findings that genetic suppression of ATXN3 inhibits CTGF expression, which can be rescued by YAP1 overexpression in ATXN3-deficient cells.",
        "evidence": [
          {
            "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
            "journal": "American Journal of Cancer Research",
            "year": 2023,
            "relevant_quote": "Herein, we report that targeted deletion of the ATXN3 gene in cancer cells by the CRISPR-Cas9 system resulted in decreased protein expression of Yes-associated protein 1 (YAP1) without altering its mRNA transcription. Interestingly, genetic ATXN3 suppression selectively inhibited the expression levels of YAP1 target genes including the connective tissue growth factor (Ctgf) and cysteine-rich angiogenic inducer 61 (Cyr61), both of which have important functions in cell adhesion, migration, proliferation and angiogenesis."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "YAP1 --activates--> CTGF:"
      },
      {
        "primary": "CYR61",
        "interaction_type": "indirect",
        "upstream_interactor": "YAP1",
        "mediator_chain": [
          "YAP1"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly promotes the expression of Cysteine-rich angiogenic inducer 61 (CYR61) by directly deubiquitinating and stabilizing the transcription factor YAP1.",
        "functions": [
          {
            "function": "CYR61 Gene Expression",
            "arrow": "activates",
            "cellular_process": "ATXN3 indirectly enhances the expression of Cysteine-rich angiogenic inducer 61 (CYR61) through its direct interaction with and stabilization of the YAP1 protein. As a deubiquitinase, ATXN3 removes ubiquitin tags from YAP1, protecting it from proteasomal degradation. This leads to an accumulation of active YAP1, which then translocates to the nucleus and, in complex with TEAD transcription factors, binds to the promoter of the CYR61 gene to drive its transcription.",
            "effect_description": "The stabilization of YAP1 by ATXN3 results in the upregulation of CYR61 transcription and subsequent protein synthesis. CYR61, a matricellular protein, is involved in promoting key aspects of tumorigenesis, including cancer cell adhesion, migration, and angiogenesis.",
            "biological_consequence": [
              "ATXN3 deubiquitinates and stabilizes YAP1 protein → Nuclear accumulation of YAP1 increases → YAP1/TEAD transcriptional complexes form → The complexes bind to the CYR61 promoter and activate gene transcription → CYR61 protein levels increase → Promotion of cancer cell adhesion, migration, and angiogenesis"
            ],
            "specific_effects": [
              "ATXN3 suppression in cancer cells selectively inhibits the expression of YAP1 target genes, including CYR61.",
              "Reconstitution of YAP1 in ATXN3-deleted cells rescues the diminished expression of CYR61.",
              "ATXN3 interacts with the WW domains of YAP1 to protect it from ubiquitination-mediated degradation."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
                "journal": "American Journal of Cancer Research",
                "year": 2023,
                "relevant_quote": "Interestingly, genetic ATXN3 suppression selectively inhibited the expression levels of YAP1 target genes including the connective tissue growth factor (Ctgf) and cysteine-rich angiogenic inducer 61 (Cyr61), both of which have important functions in cell adhesion, migration, proliferation and angiogenesis. Consequently, ATXN3 suppression resulted in reduced cancer cell growth and migration, which can also be largely rescued by YAP1 reconstitution. At the molecular level, ATNX3 interacts with the WW domains of YAP1 to protect YAP1 from ubiquitination-mediated degradation.",
                "pmid": "37818078"
              }
            ],
            "pmids": [
              "37818078"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "YAP1",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "YAP1"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3, acting as a deubiquitinase, directly interacts with the WW domains of the YAP1 protein. This interaction facilitates the removal of ubiquitin tags from YAP1, thereby protecting it from proteasomal degradation and leading to its accumulation. The stabilized and accumulated YAP1 then translocates to the nucleus, where it forms a transcriptional complex with TEAD transcription factors. This YAP1/TEAD complex subsequently binds to the promoter region of the CYR61 gene, directly activating its transcription.",
        "effect": "The ATXN3-mediated stabilization of YAP1 results in a significant upregulation of CYR61 gene transcription and subsequent increase in CYR61 protein synthesis. This elevated expression of CYR61, a matricellular protein, promotes key aspects of tumorigenesis, including enhanced cancer cell adhesion, migration, and angiogenesis.",
        "summary": "ATXN3 activates CYR61 expression by deubiquitinating and stabilizing the oncogenic transcription co-activator YAP1, thereby driving cancer progression. Reconstitution of YAP1 in ATXN3-deleted cells rescues the diminished expression of CYR61, highlighting the critical role of ATXN3 in this pathway.",
        "evidence": [
          {
            "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
            "journal": "American Journal of Cancer Research",
            "year": 2023,
            "relevant_quote": "Interestingly, genetic ATXN3 suppression selectively inhibited the expression levels of YAP1 target genes including the connective tissue growth factor (Ctgf) and cysteine-rich angiogenic inducer 61 (Cyr61), both of which have important functions in cell adhesion, migration, proliferation and angiogenesis. Consequently, ATXN3 suppression resulted in reduced cancer cell growth and migration, which can also be largely rescued by YAP1 reconstitution. At the molecular level, ATNX3 interacts with the WW domains of YAP1 to protect YAP1 from ubiquitination-mediated degradation."
          }
        ],
        "_llm_synthesized": true,
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "YAP1 --activates--> CYR61:"
      }
    ]
  }
}