{
  "primary": "PNKP",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "ATXN3 is part of a DNA repair complex with Polynucleotide-kinase-3'-phosphatase (PNKP) and HTT, suggesting a direct role in DNA damage response.",
  "functions": [
    {
      "function": "PNKP 3'-Phosphatase Activity",
      "arrow": "activates",
      "likely_direction": "main_to_primary",
      "cellular_process": "ATXN3 directly interacts with Polynucleotide-kinase-3'-phosphatase (PNKP), a key enzyme in the repair of DNA single-strand breaks. This interaction occurs as part of a larger DNA repair complex.",
      "effect_description": "The binding of wild-type ATXN3 to PNKP stimulates its 3'-phosphatase activity. This enzymatic activity is crucial for processing the ends of broken DNA strands, making them suitable for subsequent ligation and completing the repair process. This function contributes to maintaining genomic integrity.",
      "biological_consequence": [
        "ATXN3 binds to PNKP in a DNA repair complex → PNKP's 3'-phosphatase activity is stimulated → Damaged DNA strand ends are processed efficiently → DNA single-strand break repair is promoted → Neuronal survival is supported"
      ],
      "specific_effects": [
        "Wild-type ATXN3 stimulates PNKP's 3' phosphatase activity in vitro.",
        "The association between ATXN3 and PNKP promotes the removal of 3'-phosphate groups, facilitating single-strand break repair.",
        "Mutant, polyQ-expanded ATXN3 inhibits PNKP's activity, leading to the accumulation of DNA damage.",
        "ATXN3-deficient cells show decreased PNKP activity."
      ],
      "evidence": [
        {
          "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
          "year": 2014,
          "pmid": "25590633"
        },
        {
          "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
          "year": 2024,
          "pmid": "39320846"
        },
        {
          "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
          "year": 2019,
          "pmid": "30994454"
        }
      ],
      "_context": {
        "type": "direct",
        "query_protein": null,
        "chain": null
      },
      "interaction_effect": "activates",
      "direction": "",
      "pmids": [
        "25590633",
        "39320846",
        "30994454"
      ],
      "interaction_direction": "main_to_primary",
      "function_effect": "activation"
    }
  ],
  "arrow": "activates",
  "direction": "main_to_primary",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates"
    ]
  },
  "mechanism": "Wild-type ATXN3 directly interacts with Polynucleotide-kinase-3'-phosphatase (PNKP) as a component of a larger DNA repair complex. This direct physical association is critical for the functional activation of PNKP, as the binding of ATXN3 stimulates PNKP's 3'-phosphatase activity. Although specific binding domains or residues mediating this interaction and the precise molecular mechanism of stimulation (e.g., conformational change) are not detailed, the interaction is essential for PNKP's enzymatic function.",
  "effect": "As a result of ATXN3's activation, PNKP efficiently removes 3'-phosphate groups from the ends of damaged DNA strands. This enzymatic processing is crucial for preparing the DNA ends for subsequent ligation, thereby promoting the efficient repair of DNA single-strand breaks. Ultimately, this contributes to the maintenance of genomic integrity and supports neuronal survival.",
  "summary": "The ATXN3-mediated activation of PNKP's 3'-phosphatase activity is a critical step in DNA single-strand break repair, essential for maintaining genomic integrity. Notably, mutant, polyQ-expanded ATXN3 inhibits PNKP's activity, leading to the accumulation of DNA damage, which underscores its importance in neurodegenerative disease pathology.",
  "evidence": [
    {
      "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
      "year": 2014
    },
    {
      "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
      "year": 2024
    },
    {
      "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
      "year": 2019
    }
  ],
  "_llm_synthesized": true,
  "interaction_effect": "activation",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 1
  },
  "_arrow_validated": true,
  "arrow_notation": "ATXN3 --activates--> PNKP:",
  "protein_a": "ATXN3",
  "protein_b": "PNKP",
  "discovered_in_query": "ATXN3",
  "first_discovered": "2026-02-04T04:49:14.659560Z",
  "last_updated": "2026-02-04T04:49:14.659560Z"
}